ARMmbed/mbed-os/targets/TARGET_Cypress/TARGET_PSOC6/psoc6pdl/devices/include/ip/cyip_ble.h
   __IM uint32_t MMMS_SLAVE_CREATE_US_CAPT;     /*!< 0x00014088 Micro second capture for slave connection creation */
   __IM uint32_t RESERVED44[29];
  __IOM uint32_t MMMS_DATA_MEM_DESCRIPTOR[16];  /*!< 0x00014100 Data buffer descriptor 0 to 15 */
   __IM uint32_t RESERVED45[48];
  __IOM uint32_t CONN_1_DATA_LIST_SENT;         /*!< 0x00014200 data list sent update and status for connection 1 */
  __IOM uint32_t CONN_1_DATA_LIST_ACK;          /*!< 0x00014204 data list ack update and status for connection 1 */
  __IOM uint32_t CONN_1_CE_DATA_LIST_CFG;       /*!< 0x00014208 Connection specific pause resume for connection 1 */
   __IM uint32_t RESERVED46;
  __IOM uint32_t CONN_2_DATA_LIST_SENT;         /*!< 0x00014210 data list sent update and status for connection 2 */
  __IOM uint32_t CONN_2_DATA_LIST_ACK;          /*!< 0x00014214 data list ack update and status for connection 2 */
  __IOM uint32_t CONN_2_CE_DATA_LIST_CFG;       /*!< 0x00014218 Connection specific pause resume for connection 2 */
   __IM uint32_t RESERVED47;
  __IOM uint32_t CONN_3_DATA_LIST_SENT;         /*!< 0x00014220 data list sent update and status for connection 3 */
  __IOM uint32_t CONN_3_DATA_LIST_ACK;          /*!< 0x00014224 data list ack update and status for connection 3 */
  __IOM uint32_t CONN_3_CE_DATA_LIST_CFG;       /*!< 0x00014228 Connection specific pause resume for connection 3 */
   __IM uint32_t RESERVED48;
  __IOM uint32_t CONN_4_DATA_LIST_SENT;         /*!< 0x00014230 data list sent update and status for connection 4 */
  __IOM uint32_t CONN_4_DATA_LIST_ACK;          /*!< 0x00014234 data list ack update and status for connection 4 */
  __IOM uint32_t CONN_4_CE_DATA_LIST_CFG;       /*!< 0x00014238 Connection specific pause resume for connection 4 */
   __IM uint32_t RESERVED49[113];
  __IOM uint32_t MMMS_ADVCH_NI_ENABLE;          /*!< 0x00014400 Enable bits for ADV_NI, SCAN_NI and INIT_NI */
  __IOM uint32_t MMMS_ADVCH_NI_VALID;           /*!< 0x00014404 Next instant valid for ADV, SCAN, INIT */
  __IOM uint32_t MMMS_ADVCH_NI_ABORT;           /*!< 0x00014408 Abort the next instant of ADV, SCAN, INIT */
   __IM uint32_t RESERVED50;
  __IOM uint32_t CONN_PARAM_NEXT_SUP_TO;        /*!< 0x00014410 Register to configure the supervision timeout for next
                                                                scheduled connection */
  __IOM uint32_t CONN_PARAM_ACC_WIN_WIDEN;      /*!< 0x00014414 Register to configure Accumulated window widening for next
                                                                scheduled connection */
   __IM uint32_t RESERVED51[2];
  __IOM uint32_t HW_LOAD_OFFSET;                /*!< 0x00014420 Register to configure offset from connection anchor point at
                                                                which connection parameter memory should be read */
   __IM uint32_t ADV_RAND;                      /*!< 0x00014424 Random number generated by Hardware for ADV NI calculation */
   __IM uint32_t MMMS_RX_PKT_CNTR;              /*!< 0x00014428 Packet Counter of packets in RX FIFO in MMMS mode */
   __IM uint32_t RESERVED52;
   __IM uint32_t CONN_RX_PKT_CNTR[8];           /*!< 0x00014430 Packet Counter for Individual connection index */
   __IM uint32_t RESERVED53[236];
  __IOM uint32_t WHITELIST_BASE_ADDR;           /*!< 0x00014800 Whitelist base address */
   __IM uint32_t RESERVED54[47];
  __IOM uint32_t RSLV_LIST_PEER_IDNTT_BASE_ADDR; /*!< 0x000148C0 Resolving list base address for storing Peer Identity address */
   __IM uint32_t RESERVED55[47];
  __IOM uint32_t RSLV_LIST_PEER_RPA_BASE_ADDR;  /*!< 0x00014980 Resolving list base address for storing resolved Peer RPA
                                                                address */
   __IM uint32_t RESERVED56[47];
  __IOM uint32_t RSLV_LIST_RCVD_INIT_RPA_BASE_ADDR; /*!< 0x00014A40 Resolving list base address for storing Resolved received INITA
                                                                RPA */
   __IM uint32_t RESERVED57[47];
  __IOM uint32_t RSLV_LIST_TX_INIT_RPA_BASE_ADDR; /*!< 0x00014B00 Resolving list base address for storing generated TX INITA RPA */
   __IM uint32_t RESERVED58[9535];
} BLE_BLELL_V1_Type;                            /*!< Size = 122880 (0x1E000) */

/**
  * \brief Bluetooth Low Energy Subsystem Miscellaneous (BLE_BLESS)
  */
typedef struct {
   __IM uint32_t RESERVED[24];
  __IOM uint32_t DDFT_CONFIG;                   /*!< 0x00000060 BLESS DDFT configuration register */
  __IOM uint32_t XTAL_CLK_DIV_CONFIG;           /*!< 0x00000064 Crystal clock divider configuration register */
  __IOM uint32_t INTR_STAT;                     /*!< 0x00000068 Link Layer interrupt status register */
  __IOM uint32_t INTR_MASK;                     /*!< 0x0000006C Link Layer interrupt mask register */
  __IOM uint32_t LL_CLK_EN;                     /*!< 0x00000070 Link Layer primary clock enable */
  __IOM uint32_t LF_CLK_CTRL;                   /*!< 0x00000074 BLESS LF clock control and BLESS revision ID indicator */
  __IOM uint32_t EXT_PA_LNA_CTRL;               /*!< 0x00000078 External TX PA and RX LNA control */
   __IM uint32_t RESERVED1;
   __IM uint32_t LL_PKT_RSSI_CH_ENERGY;         /*!< 0x00000080 Link Layer Last Received packet RSSI/Channel energy and channel
                                                                number */
   __IM uint32_t BT_CLOCK_CAPT;                 /*!< 0x00000084 BT clock captured on an LL DSM exit */
   __IM uint32_t RESERVED2[6];
  __IOM uint32_t MT_CFG;                        /*!< 0x000000A0 MT Configuration Register */
  __IOM uint32_t MT_DELAY_CFG;                  /*!< 0x000000A4 MT Delay configuration for state transitions */
  __IOM uint32_t MT_DELAY_CFG2;                 /*!< 0x000000A8 MT Delay configuration for state transitions */
  __IOM uint32_t MT_DELAY_CFG3;                 /*!< 0x000000AC MT Delay configuration for state transitions */
  __IOM uint32_t MT_VIO_CTRL;                   /*!< 0x000000B0 MT Configuration Register to control VIO switches */
   __IM uint32_t MT_STATUS;                     /*!< 0x000000B4 MT Status Register */
   __IM uint32_t PWR_CTRL_SM_ST;                /*!< 0x000000B8 Link Layer Power Control FSM Status Register */
   __IM uint32_t RESERVED3;
  __IOM uint32_t HVLDO_CTRL;                    /*!< 0x000000C0 HVLDO Configuration register */
  __IOM uint32_t MISC_EN_CTRL;                  /*!< 0x000000C4 Radio Buck and Active regulator enable control */
   __IM uint32_t RESERVED4[2];
  __IOM uint32_t EFUSE_CONFIG;                  /*!< 0x000000D0 EFUSE mode configuration register */
  __IOM uint32_t EFUSE_TIM_CTRL1;               /*!< 0x000000D4 EFUSE timing control register (common for Program and Read
                                                                modes) */
  __IOM uint32_t EFUSE_TIM_CTRL2;               /*!< 0x000000D8 EFUSE timing control Register (for Read) */
  __IOM uint32_t EFUSE_TIM_CTRL3;               /*!< 0x000000DC EFUSE timing control Register (for Program) */
   __IM uint32_t EFUSE_RDATA_L;                 /*!< 0x000000E0 EFUSE Lower read data */
   __IM uint32_t EFUSE_RDATA_H;                 /*!< 0x000000E4 EFUSE higher read data */
  __IOM uint32_t EFUSE_WDATA_L;                 /*!< 0x000000E8 EFUSE lower write word */
  __IOM uint32_t EFUSE_WDATA_H;                 /*!< 0x000000EC EFUSE higher write word */
  __IOM uint32_t DIV_BY_625_CFG;                /*!< 0x000000F0 Divide by 625 for FW Use */
   __IM uint32_t DIV_BY_625_STS;                /*!< 0x000000F4 Output of divide by 625 divider */
   __IM uint32_t RESERVED5[2];
  __IOM uint32_t PACKET_COUNTER0;               /*!< 0x00000100 Packet counter 0 */
  __IOM uint32_t PACKET_COUNTER2;               /*!< 0x00000104 Packet counter 2 */
  __IOM uint32_t IV_MASTER0;                    /*!< 0x00000108 Master Initialization Vector 0 */
  __IOM uint32_t IV_SLAVE0;                     /*!< 0x0000010C Slave Initialization Vector 0 */
   __OM uint32_t ENC_KEY[4];                    /*!< 0x00000110 Encryption Key register 0-3 */
  __IOM uint32_t MIC_IN0;                       /*!< 0x00000120 MIC input register */
   __IM uint32_t MIC_OUT0;                      /*!< 0x00000124 MIC output register */
  __IOM uint32_t ENC_PARAMS;                    /*!< 0x00000128 Encryption Parameter register */
  __IOM uint32_t ENC_CONFIG;                    /*!< 0x0000012C Encryption Configuration */
  __IOM uint32_t ENC_INTR_EN;                   /*!< 0x00000130 Encryption Interrupt enable */
  __IOM uint32_t ENC_INTR;                      /*!< 0x00000134 Encryption Interrupt status and clear register */
   __IM uint32_t RESERVED6[2];
  __IOM uint32_t B1_DATA_REG[4];                /*!< 0x00000140 Programmable B1 Data register (0-3) */
  __IOM uint32_t ENC_MEM_BASE_ADDR;             /*!< 0x00000150 Encryption memory base address */
   __IM uint32_t RESERVED7[875];
  __IOM uint32_t TRIM_LDO_0;                    /*!< 0x00000F00 LDO Trim register 0 */
  __IOM uint32_t TRIM_LDO_1;                    /*!< 0x00000F04 LDO Trim register 1 */
  __IOM uint32_t TRIM_LDO_2;                    /*!< 0x00000F08 LDO Trim register 2 */
  __IOM uint32_t TRIM_LDO_3;                    /*!< 0x00000F0C LDO Trim register 3 */
  __IOM uint32_t TRIM_MXD[4];                   /*!< 0x00000F10 MXD die Trim registers */
   __IM uint32_t RESERVED8[4];
  __IOM uint32_t TRIM_LDO_4;                    /*!< 0x00000F30 LDO Trim register 4 */
  __IOM uint32_t TRIM_LDO_5;                    /*!< 0x00000F34 LDO Trim register 5 */
   __IM uint32_t RESERVED9[50];
} BLE_BLESS_V1_Type;                            /*!< Size = 4096 (0x1000) */

/**
  * \brief Bluetooth Low Energy Subsystem (BLE)
  */
typedef struct {
        BLE_RCB_V1_Type RCB;                    /*!< 0x00000000 Radio Control Bus (RCB) controller */
   __IM uint32_t RESERVED[896];
        BLE_BLELL_V1_Type BLELL;                /*!< 0x00001000 Bluetooth Low Energy Link Layer */
        BLE_BLESS_V1_Type BLESS;                /*!< 0x0001F000 Bluetooth Low Energy Subsystem Miscellaneous */
} BLE_V1_Type;                                  /*!< Size = 131072 (0x20000) */


/* BLE_RCB_RCBLL.CTRL */
#define BLE_RCB_RCBLL_CTRL_RCBLL_CTRL_Pos       0UL
#define BLE_RCB_RCBLL_CTRL_RCBLL_CTRL_Msk       0x1UL
#define BLE_RCB_RCBLL_CTRL_RCBLL_CPU_REQ_Pos    1UL
#define BLE_RCB_RCBLL_CTRL_RCBLL_CPU_REQ_Msk    0x2UL
#define BLE_RCB_RCBLL_CTRL_CPU_SINGLE_WRITE_Pos 2UL
#define BLE_RCB_RCBLL_CTRL_CPU_SINGLE_WRITE_Msk 0x4UL
#define BLE_RCB_RCBLL_CTRL_CPU_SINGLE_READ_Pos  3UL
#define BLE_RCB_RCBLL_CTRL_CPU_SINGLE_READ_Msk  0x8UL
#define BLE_RCB_RCBLL_CTRL_ALLOW_CPU_ACCESS_TX_RX_Pos 4UL
#define BLE_RCB_RCBLL_CTRL_ALLOW_CPU_ACCESS_TX_RX_Msk 0x10UL
#define BLE_RCB_RCBLL_CTRL_ENABLE_RADIO_BOD_Pos 5UL
#define BLE_RCB_RCBLL_CTRL_ENABLE_RADIO_BOD_Msk 0x20UL
/* BLE_RCB_RCBLL.INTR */
#define BLE_RCB_RCBLL_INTR_RCB_LL_DONE_Pos      0UL
#define BLE_RCB_RCBLL_INTR_RCB_LL_DONE_Msk      0x1UL
#define BLE_RCB_RCBLL_INTR_SINGLE_WRITE_DONE_Pos 2UL
#define BLE_RCB_RCBLL_INTR_SINGLE_WRITE_DONE_Msk 0x4UL
#define BLE_RCB_RCBLL_INTR_SINGLE_READ_DONE_Pos 3UL
#define BLE_RCB_RCBLL_INTR_SINGLE_READ_DONE_Msk 0x8UL
/* BLE_RCB_RCBLL.INTR_SET */
#define BLE_RCB_RCBLL_INTR_SET_RCB_LL_DONE_Pos  0UL
#define BLE_RCB_RCBLL_INTR_SET_RCB_LL_DONE_Msk  0x1UL
#define BLE_RCB_RCBLL_INTR_SET_SINGLE_WRITE_DONE_Pos 2UL
#define BLE_RCB_RCBLL_INTR_SET_SINGLE_WRITE_DONE_Msk 0x4UL
#define BLE_RCB_RCBLL_INTR_SET_SINGLE_READ_DONE_Pos 3UL
#define BLE_RCB_RCBLL_INTR_SET_SINGLE_READ_DONE_Msk 0x8UL
/* BLE_RCB_RCBLL.INTR_MASK */
#define BLE_RCB_RCBLL_INTR_MASK_RCB_LL_DONE_Pos 0UL
#define BLE_RCB_RCBLL_INTR_MASK_RCB_LL_DONE_Msk 0x1UL
#define BLE_RCB_RCBLL_INTR_MASK_SINGLE_WRITE_DONE_Pos 2UL
#define BLE_RCB_RCBLL_INTR_MASK_SINGLE_WRITE_DONE_Msk 0x4UL
#define BLE_RCB_RCBLL_INTR_MASK_SINGLE_READ_DONE_Pos 3UL
#define BLE_RCB_RCBLL_INTR_MASK_SINGLE_READ_DONE_Msk 0x8UL
/* BLE_RCB_RCBLL.INTR_MASKED */
#define BLE_RCB_RCBLL_INTR_MASKED_RCB_LL_DONE_Pos 0UL
#define BLE_RCB_RCBLL_INTR_MASKED_RCB_LL_DONE_Msk 0x1UL
#define BLE_RCB_RCBLL_INTR_MASKED_SINGLE_WRITE_DONE_Pos 2UL
#define BLE_RCB_RCBLL_INTR_MASKED_SINGLE_WRITE_DONE_Msk 0x4UL
#define BLE_RCB_RCBLL_INTR_MASKED_SINGLE_READ_DONE_Pos 3UL
#define BLE_RCB_RCBLL_INTR_MASKED_SINGLE_READ_DONE_Msk 0x8UL
/* BLE_RCB_RCBLL.RADIO_REG1_ADDR */
#define BLE_RCB_RCBLL_RADIO_REG1_ADDR_REG_ADDR_Pos 0UL
#define BLE_RCB_RCBLL_RADIO_REG1_ADDR_REG_ADDR_Msk 0xFFFFUL
/* BLE_RCB_RCBLL.RADIO_REG2_ADDR */
#define BLE_RCB_RCBLL_RADIO_REG2_ADDR_REG_ADDR_Pos 0UL
#define BLE_RCB_RCBLL_RADIO_REG2_ADDR_REG_ADDR_Msk 0xFFFFUL
/* BLE_RCB_RCBLL.RADIO_REG3_ADDR */
#define BLE_RCB_RCBLL_RADIO_REG3_ADDR_REG_ADDR_Pos 0UL
#define BLE_RCB_RCBLL_RADIO_REG3_ADDR_REG_ADDR_Msk 0xFFFFUL
/* BLE_RCB_RCBLL.RADIO_REG4_ADDR */
#define BLE_RCB_RCBLL_RADIO_REG4_ADDR_REG_ADDR_Pos 0UL
#define BLE_RCB_RCBLL_RADIO_REG4_ADDR_REG_ADDR_Msk 0xFFFFUL
/* BLE_RCB_RCBLL.RADIO_REG5_ADDR */
#define BLE_RCB_RCBLL_RADIO_REG5_ADDR_REG_ADDR_Pos 0UL
#define BLE_RCB_RCBLL_RADIO_REG5_ADDR_REG_ADDR_Msk 0xFFFFUL
/* BLE_RCB_RCBLL.CPU_WRITE_REG */
#define BLE_RCB_RCBLL_CPU_WRITE_REG_ADDR_Pos    0UL
#define BLE_RCB_RCBLL_CPU_WRITE_REG_ADDR_Msk    0xFFFFUL
#define BLE_RCB_RCBLL_CPU_WRITE_REG_WRITE_DATA_Pos 16UL
#define BLE_RCB_RCBLL_CPU_WRITE_REG_WRITE_DATA_Msk 0xFFFF0000UL
/* BLE_RCB_RCBLL.CPU_READ_REG */
#define BLE_RCB_RCBLL_CPU_READ_REG_ADDR_Pos     0UL
#define BLE_RCB_RCBLL_CPU_READ_REG_ADDR_Msk     0xFFFFUL
#define BLE_RCB_RCBLL_CPU_READ_REG_READ_DATA_Pos 16UL
#define BLE_RCB_RCBLL_CPU_READ_REG_READ_DATA_Msk 0xFFFF0000UL


/* BLE_RCB.CTRL */
#define BLE_RCB_CTRL_TX_CLK_EDGE_Pos            1UL
#define BLE_RCB_CTRL_TX_CLK_EDGE_Msk            0x2UL
#define BLE_RCB_CTRL_RX_CLK_EDGE_Pos            2UL
#define BLE_RCB_CTRL_RX_CLK_EDGE_Msk            0x4UL
#define BLE_RCB_CTRL_RX_CLK_SRC_Pos             3UL
#define BLE_RCB_CTRL_RX_CLK_SRC_Msk             0x8UL
#define BLE_RCB_CTRL_SCLK_CONTINUOUS_Pos        4UL
#define BLE_RCB_CTRL_SCLK_CONTINUOUS_Msk        0x10UL
#define BLE_RCB_CTRL_SSEL_POLARITY_Pos          5UL
#define BLE_RCB_CTRL_SSEL_POLARITY_Msk          0x20UL
#define BLE_RCB_CTRL_LEAD_Pos                   8UL
#define BLE_RCB_CTRL_LEAD_Msk                   0x300UL
#define BLE_RCB_CTRL_LAG_Pos                    10UL
#define BLE_RCB_CTRL_LAG_Msk                    0xC00UL
#define BLE_RCB_CTRL_DIV_ENABLED_Pos            12UL
#define BLE_RCB_CTRL_DIV_ENABLED_Msk            0x1000UL
#define BLE_RCB_CTRL_DIV_Pos                    13UL
#define BLE_RCB_CTRL_DIV_Msk                    0x7E000UL
#define BLE_RCB_CTRL_ADDR_WIDTH_Pos             19UL
#define BLE_RCB_CTRL_ADDR_WIDTH_Msk             0x780000UL
#define BLE_RCB_CTRL_DATA_WIDTH_Pos             23UL
#define BLE_RCB_CTRL_DATA_WIDTH_Msk             0x800000UL
#define BLE_RCB_CTRL_ENABLED_Pos                31UL
#define BLE_RCB_CTRL_ENABLED_Msk                0x80000000UL
/* BLE_RCB.STATUS */
#define BLE_RCB_STATUS_BUS_BUSY_Pos             0UL
#define BLE_RCB_STATUS_BUS_BUSY_Msk             0x1UL
/* BLE_RCB.TX_CTRL */
#define BLE_RCB_TX_CTRL_MSB_FIRST_Pos           0UL
#define BLE_RCB_TX_CTRL_MSB_FIRST_Msk           0x1UL
#define BLE_RCB_TX_CTRL_FIFO_RECONFIG_Pos       1UL
#define BLE_RCB_TX_CTRL_FIFO_RECONFIG_Msk       0x2UL
#define BLE_RCB_TX_CTRL_TX_ENTRIES_Pos          2UL
#define BLE_RCB_TX_CTRL_TX_ENTRIES_Msk          0x7CUL
/* BLE_RCB.TX_FIFO_CTRL */
#define BLE_RCB_TX_FIFO_CTRL_TX_TRIGGER_LEVEL_Pos 0UL
#define BLE_RCB_TX_FIFO_CTRL_TX_TRIGGER_LEVEL_Msk 0x1FUL
#define BLE_RCB_TX_FIFO_CTRL_CLEAR_Pos          16UL
#define BLE_RCB_TX_FIFO_CTRL_CLEAR_Msk          0x10000UL
/* BLE_RCB.TX_FIFO_STATUS */
#define BLE_RCB_TX_FIFO_STATUS_USED_Pos         0UL
#define BLE_RCB_TX_FIFO_STATUS_USED_Msk         0x1FUL
#define BLE_RCB_TX_FIFO_STATUS_SR_VALID_Pos     15UL
#define BLE_RCB_TX_FIFO_STATUS_SR_VALID_Msk     0x8000UL
#define BLE_RCB_TX_FIFO_STATUS_RD_PTR_Pos       16UL
#define BLE_RCB_TX_FIFO_STATUS_RD_PTR_Msk       0xF0000UL
#define BLE_RCB_TX_FIFO_STATUS_WR_PTR_Pos       24UL
#define BLE_RCB_TX_FIFO_STATUS_WR_PTR_Msk       0xF000000UL
/* BLE_RCB.TX_FIFO_WR */
#define BLE_RCB_TX_FIFO_WR_DATA_Pos             0UL
#define BLE_RCB_TX_FIFO_WR_DATA_Msk             0xFFFFFFFFUL
/* BLE_RCB.RX_CTRL */
#define BLE_RCB_RX_CTRL_MSB_FIRST_Pos           0UL
#define BLE_RCB_RX_CTRL_MSB_FIRST_Msk           0x1UL
/* BLE_RCB.RX_FIFO_CTRL */
#define BLE_RCB_RX_FIFO_CTRL_TRIGGER_LEVEL_Pos  0UL
#define BLE_RCB_RX_FIFO_CTRL_TRIGGER_LEVEL_Msk  0xFUL
#define BLE_RCB_RX_FIFO_CTRL_CLEAR_Pos          16UL
#define BLE_RCB_RX_FIFO_CTRL_CLEAR_Msk          0x10000UL
/* BLE_RCB.RX_FIFO_STATUS */
#define BLE_RCB_RX_FIFO_STATUS_USED_Pos         0UL
#define BLE_RCB_RX_FIFO_STATUS_USED_Msk         0x1FUL
#define BLE_RCB_RX_FIFO_STATUS_SR_VALID_Pos     15UL
#define BLE_RCB_RX_FIFO_STATUS_SR_VALID_Msk     0x8000UL
#define BLE_RCB_RX_FIFO_STATUS_RD_PTR_Pos       16UL
#define BLE_RCB_RX_FIFO_STATUS_RD_PTR_Msk       0xF0000UL
#define BLE_RCB_RX_FIFO_STATUS_WR_PTR_Pos       24UL
#define BLE_RCB_RX_FIFO_STATUS_WR_PTR_Msk       0xF000000UL
/* BLE_RCB.RX_FIFO_RD */
#define BLE_RCB_RX_FIFO_RD_DATA_Pos             0UL
#define BLE_RCB_RX_FIFO_RD_DATA_Msk             0xFFFFFFFFUL
/* BLE_RCB.RX_FIFO_RD_SILENT */
#define BLE_RCB_RX_FIFO_RD_SILENT_DATA_Pos      0UL
#define BLE_RCB_RX_FIFO_RD_SILENT_DATA_Msk      0xFFFFFFFFUL
/* BLE_RCB.INTR */
#define BLE_RCB_INTR_RCB_DONE_Pos               0UL
#define BLE_RCB_INTR_RCB_DONE_Msk               0x1UL
#define BLE_RCB_INTR_TX_FIFO_TRIGGER_Pos        8UL
#define BLE_RCB_INTR_TX_FIFO_TRIGGER_Msk        0x100UL
#define BLE_RCB_INTR_TX_FIFO_NOT_FULL_Pos       9UL
#define BLE_RCB_INTR_TX_FIFO_NOT_FULL_Msk       0x200UL
#define BLE_RCB_INTR_TX_FIFO_EMPTY_Pos          10UL
#define BLE_RCB_INTR_TX_FIFO_EMPTY_Msk          0x400UL
#define BLE_RCB_INTR_TX_FIFO_OVERFLOW_Pos       11UL
#define BLE_RCB_INTR_TX_FIFO_OVERFLOW_Msk       0x800UL
#define BLE_RCB_INTR_TX_FIFO_UNDERFLOW_Pos      12UL
#define BLE_RCB_INTR_TX_FIFO_UNDERFLOW_Msk      0x1000UL
#define BLE_RCB_INTR_RX_FIFO_TRIGGER_Pos        16UL
#define BLE_RCB_INTR_RX_FIFO_TRIGGER_Msk        0x10000UL
#define BLE_RCB_INTR_RX_FIFO_NOT_EMPTY_Pos      17UL
#define BLE_RCB_INTR_RX_FIFO_NOT_EMPTY_Msk      0x20000UL
#define BLE_RCB_INTR_RX_FIFO_FULL_Pos           18UL
#define BLE_RCB_INTR_RX_FIFO_FULL_Msk           0x40000UL
#define BLE_RCB_INTR_RX_FIFO_OVERFLOW_Pos       19UL
#define BLE_RCB_INTR_RX_FIFO_OVERFLOW_Msk       0x80000UL
#define BLE_RCB_INTR_RX_FIFO_UNDERFLOW_Pos      20UL
#define BLE_RCB_INTR_RX_FIFO_UNDERFLOW_Msk      0x100000UL
/* BLE_RCB.INTR_SET */
#define BLE_RCB_INTR_SET_RCB_DONE_Pos           0UL
#define BLE_RCB_INTR_SET_RCB_DONE_Msk           0x1UL
#define BLE_RCB_INTR_SET_TX_FIFO_TRIGGER_Pos    8UL
#define BLE_RCB_INTR_SET_TX_FIFO_TRIGGER_Msk    0x100UL
#define BLE_RCB_INTR_SET_TX_FIFO_NOT_FULL_Pos   9UL
#define BLE_RCB_INTR_SET_TX_FIFO_NOT_FULL_Msk   0x200UL
#define BLE_RCB_INTR_SET_TX_FIFO_EMPTY_Pos      10UL
#define BLE_RCB_INTR_SET_TX_FIFO_EMPTY_Msk      0x400UL
#define BLE_RCB_INTR_SET_TX_FIFO_OVERFLOW_Pos   11UL
#define BLE_RCB_INTR_SET_TX_FIFO_OVERFLOW_Msk   0x800UL
#define BLE_RCB_INTR_SET_TX_FIFO_UNDERFLOW_Pos  12UL
#define BLE_RCB_INTR_SET_TX_FIFO_UNDERFLOW_Msk  0x1000UL
#define BLE_RCB_INTR_SET_RX_FIFO_TRIGGER_Pos    16UL
#define BLE_RCB_INTR_SET_RX_FIFO_TRIGGER_Msk    0x10000UL
#define BLE_RCB_INTR_SET_RX_FIFO_NOT_EMPTY_Pos  17UL
#define BLE_RCB_INTR_SET_RX_FIFO_NOT_EMPTY_Msk  0x20000UL
#define BLE_RCB_INTR_SET_RX_FIFO_FULL_Pos       18UL
#define BLE_RCB_INTR_SET_RX_FIFO_FULL_Msk       0x40000UL
#define BLE_RCB_INTR_SET_RX_FIFO_OVERFLOW_Pos   19UL
#define BLE_RCB_INTR_SET_RX_FIFO_OVERFLOW_Msk   0x80000UL
#define BLE_RCB_INTR_SET_RX_FIFO_UNDERFLOW_Pos  20UL
#define BLE_RCB_INTR_SET_RX_FIFO_UNDERFLOW_Msk  0x100000UL
/* BLE_RCB.INTR_MASK */
#define BLE_RCB_INTR_MASK_RCB_DONE_Pos          0UL
#define BLE_RCB_INTR_MASK_RCB_DONE_Msk          0x1UL
#define BLE_RCB_INTR_MASK_TX_FIFO_TRIGGER_Pos   8UL
#define BLE_RCB_INTR_MASK_TX_FIFO_TRIGGER_Msk   0x100UL
#define BLE_RCB_INTR_MASK_TX_FIFO_NOT_FULL_Pos  9UL
#define BLE_RCB_INTR_MASK_TX_FIFO_NOT_FULL_Msk  0x200UL
#define BLE_RCB_INTR_MASK_TX_FIFO_EMPTY_Pos     10UL
#define BLE_RCB_INTR_MASK_TX_FIFO_EMPTY_Msk     0x400UL
#define BLE_RCB_INTR_MASK_TX_FIFO_OVERFLOW_Pos  11UL
#define BLE_RCB_INTR_MASK_TX_FIFO_OVERFLOW_Msk  0x800UL
#define BLE_RCB_INTR_MASK_TX_FIFO_UNDERFLOW_Pos 12UL
#define BLE_RCB_INTR_MASK_TX_FIFO_UNDERFLOW_Msk 0x1000UL
#define BLE_RCB_INTR_MASK_RX_FIFO_TRIGGER_Pos   16UL
#define BLE_RCB_INTR_MASK_RX_FIFO_TRIGGER_Msk   0x10000UL
#define BLE_RCB_INTR_MASK_RX_FIFO_NOT_EMPTY_Pos 17UL
#define BLE_RCB_INTR_MASK_RX_FIFO_NOT_EMPTY_Msk 0x20000UL
#define BLE_RCB_INTR_MASK_RX_FIFO_FULL_Pos      18UL
#define BLE_RCB_INTR_MASK_RX_FIFO_FULL_Msk      0x40000UL
#define BLE_RCB_INTR_MASK_RX_FIFO_OVERFLOW_Pos  19UL
#define BLE_RCB_INTR_MASK_RX_FIFO_OVERFLOW_Msk  0x80000UL
#define BLE_RCB_INTR_MASK_RX_FIFO_UNDERFLOW_Pos 20UL
#define BLE_RCB_INTR_MASK_RX_FIFO_UNDERFLOW_Msk 0x100000UL
/* BLE_RCB.INTR_MASKED */
#define BLE_RCB_INTR_MASKED_RCB_DONE_Pos        0UL
#define BLE_RCB_INTR_MASKED_RCB_DONE_Msk        0x1UL
#define BLE_RCB_INTR_MASKED_TX_FIFO_TRIGGER_Pos 8UL
#define BLE_RCB_INTR_MASKED_TX_FIFO_TRIGGER_Msk 0x100UL
#define BLE_RCB_INTR_MASKED_TX_FIFO_NOT_FULL_Pos 9UL
#define BLE_RCB_INTR_MASKED_TX_FIFO_NOT_FULL_Msk 0x200UL
#define BLE_RCB_INTR_MASKED_TX_FIFO_EMPTY_Pos   10UL
#define BLE_RCB_INTR_MASKED_TX_FIFO_EMPTY_Msk   0x400UL
#define BLE_RCB_INTR_MASKED_TX_FIFO_OVERFLOW_Pos 11UL
#define BLE_RCB_INTR_MASKED_TX_FIFO_OVERFLOW_Msk 0x800UL
#define BLE_RCB_INTR_MASKED_TX_FIFO_UNDERFLOW_Pos 12UL
#define BLE_RCB_INTR_MASKED_TX_FIFO_UNDERFLOW_Msk 0x1000UL
#define BLE_RCB_INTR_MASKED_RX_FIFO_TRIGGER_Pos 16UL
#define BLE_RCB_INTR_MASKED_RX_FIFO_TRIGGER_Msk 0x10000UL
#define BLE_RCB_INTR_MASKED_RX_FIFO_NOT_EMPTY_Pos 17UL
#define BLE_RCB_INTR_MASKED_RX_FIFO_NOT_EMPTY_Msk 0x20000UL
#define BLE_RCB_INTR_MASKED_RX_FIFO_FULL_Pos    18UL
#define BLE_RCB_INTR_MASKED_RX_FIFO_FULL_Msk    0x40000UL
#define BLE_RCB_INTR_MASKED_RX_FIFO_OVERFLOW_Pos 19UL
#define BLE_RCB_INTR_MASKED_RX_FIFO_OVERFLOW_Msk 0x80000UL
#define BLE_RCB_INTR_MASKED_RX_FIFO_UNDERFLOW_Pos 20UL
#define BLE_RCB_INTR_MASKED_RX_FIFO_UNDERFLOW_Msk 0x100000UL


