ARMmbed/mbed-os/targets/TARGET_Cypress/TARGET_PSOC6/psoc6pdl/devices/include/ip/cyip_ble.h
/* BLE_BLELL.COMMAND_REGISTER */
#define BLE_BLELL_COMMAND_REGISTER_COMMAND_Pos  0UL
#define BLE_BLELL_COMMAND_REGISTER_COMMAND_Msk  0xFFUL
/* BLE_BLELL.EVENT_INTR */
#define BLE_BLELL_EVENT_INTR_ADV_INTR_Pos       0UL
#define BLE_BLELL_EVENT_INTR_ADV_INTR_Msk       0x1UL
#define BLE_BLELL_EVENT_INTR_SCAN_INTR_Pos      1UL
#define BLE_BLELL_EVENT_INTR_SCAN_INTR_Msk      0x2UL
#define BLE_BLELL_EVENT_INTR_INIT_INTR_Pos      2UL
#define BLE_BLELL_EVENT_INTR_INIT_INTR_Msk      0x4UL
#define BLE_BLELL_EVENT_INTR_CONN_INTR_Pos      3UL
#define BLE_BLELL_EVENT_INTR_CONN_INTR_Msk      0x8UL
#define BLE_BLELL_EVENT_INTR_SM_INTR_Pos        4UL
#define BLE_BLELL_EVENT_INTR_SM_INTR_Msk        0x10UL
#define BLE_BLELL_EVENT_INTR_DSM_INTR_Pos       5UL
#define BLE_BLELL_EVENT_INTR_DSM_INTR_Msk       0x20UL
#define BLE_BLELL_EVENT_INTR_ENC_INTR_Pos       6UL
#define BLE_BLELL_EVENT_INTR_ENC_INTR_Msk       0x40UL
#define BLE_BLELL_EVENT_INTR_RSSI_RX_DONE_INTR_Pos 7UL
#define BLE_BLELL_EVENT_INTR_RSSI_RX_DONE_INTR_Msk 0x80UL
/* BLE_BLELL.EVENT_ENABLE */
#define BLE_BLELL_EVENT_ENABLE_ADV_INT_EN_Pos   0UL
#define BLE_BLELL_EVENT_ENABLE_ADV_INT_EN_Msk   0x1UL
#define BLE_BLELL_EVENT_ENABLE_SCN_INT_EN_Pos   1UL
#define BLE_BLELL_EVENT_ENABLE_SCN_INT_EN_Msk   0x2UL
#define BLE_BLELL_EVENT_ENABLE_INIT_INT_EN_Pos  2UL
#define BLE_BLELL_EVENT_ENABLE_INIT_INT_EN_Msk  0x4UL
#define BLE_BLELL_EVENT_ENABLE_CONN_INT_EN_Pos  3UL
#define BLE_BLELL_EVENT_ENABLE_CONN_INT_EN_Msk  0x8UL
#define BLE_BLELL_EVENT_ENABLE_SM_INT_EN_Pos    4UL
#define BLE_BLELL_EVENT_ENABLE_SM_INT_EN_Msk    0x10UL
#define BLE_BLELL_EVENT_ENABLE_DSM_INT_EN_Pos   5UL
#define BLE_BLELL_EVENT_ENABLE_DSM_INT_EN_Msk   0x20UL
#define BLE_BLELL_EVENT_ENABLE_ENC_INT_EN_Pos   6UL
#define BLE_BLELL_EVENT_ENABLE_ENC_INT_EN_Msk   0x40UL
#define BLE_BLELL_EVENT_ENABLE_RSSI_RX_DONE_INT_EN_Pos 7UL
#define BLE_BLELL_EVENT_ENABLE_RSSI_RX_DONE_INT_EN_Msk 0x80UL
/* BLE_BLELL.ADV_PARAMS */
#define BLE_BLELL_ADV_PARAMS_TX_ADDR_Pos        0UL
#define BLE_BLELL_ADV_PARAMS_TX_ADDR_Msk        0x1UL
#define BLE_BLELL_ADV_PARAMS_ADV_TYPE_Pos       1UL
#define BLE_BLELL_ADV_PARAMS_ADV_TYPE_Msk       0x6UL
#define BLE_BLELL_ADV_PARAMS_ADV_FILT_POLICY_Pos 3UL
#define BLE_BLELL_ADV_PARAMS_ADV_FILT_POLICY_Msk 0x18UL
#define BLE_BLELL_ADV_PARAMS_ADV_CHANNEL_MAP_Pos 5UL
#define BLE_BLELL_ADV_PARAMS_ADV_CHANNEL_MAP_Msk 0xE0UL
#define BLE_BLELL_ADV_PARAMS_RX_ADDR_Pos        8UL
#define BLE_BLELL_ADV_PARAMS_RX_ADDR_Msk        0x100UL
#define BLE_BLELL_ADV_PARAMS_RX_SEC_ADDR_Pos    9UL
#define BLE_BLELL_ADV_PARAMS_RX_SEC_ADDR_Msk    0x200UL
#define BLE_BLELL_ADV_PARAMS_ADV_LOW_DUTY_CYCLE_Pos 10UL
#define BLE_BLELL_ADV_PARAMS_ADV_LOW_DUTY_CYCLE_Msk 0x400UL
#define BLE_BLELL_ADV_PARAMS_INITA_RPA_CHECK_Pos 11UL
#define BLE_BLELL_ADV_PARAMS_INITA_RPA_CHECK_Msk 0x800UL
#define BLE_BLELL_ADV_PARAMS_TX_ADDR_PRIV_Pos   12UL
#define BLE_BLELL_ADV_PARAMS_TX_ADDR_PRIV_Msk   0x1000UL
#define BLE_BLELL_ADV_PARAMS_ADV_RCV_IA_IN_PRIV_Pos 13UL
#define BLE_BLELL_ADV_PARAMS_ADV_RCV_IA_IN_PRIV_Msk 0x2000UL
#define BLE_BLELL_ADV_PARAMS_ADV_RPT_PEER_NRPA_ADDR_IN_PRIV_Pos 14UL
#define BLE_BLELL_ADV_PARAMS_ADV_RPT_PEER_NRPA_ADDR_IN_PRIV_Msk 0x4000UL
#define BLE_BLELL_ADV_PARAMS_RCV_TX_ADDR_Pos    15UL
#define BLE_BLELL_ADV_PARAMS_RCV_TX_ADDR_Msk    0x8000UL
/* BLE_BLELL.ADV_INTERVAL_TIMEOUT */
#define BLE_BLELL_ADV_INTERVAL_TIMEOUT_ADV_INTERVAL_Pos 0UL
#define BLE_BLELL_ADV_INTERVAL_TIMEOUT_ADV_INTERVAL_Msk 0x7FFFUL
/* BLE_BLELL.ADV_INTR */
#define BLE_BLELL_ADV_INTR_ADV_STRT_INTR_Pos    0UL
#define BLE_BLELL_ADV_INTR_ADV_STRT_INTR_Msk    0x1UL
#define BLE_BLELL_ADV_INTR_ADV_CLOSE_INTR_Pos   1UL
#define BLE_BLELL_ADV_INTR_ADV_CLOSE_INTR_Msk   0x2UL
#define BLE_BLELL_ADV_INTR_ADV_TX_INTR_Pos      2UL
#define BLE_BLELL_ADV_INTR_ADV_TX_INTR_Msk      0x4UL
#define BLE_BLELL_ADV_INTR_SCAN_RSP_TX_INTR_Pos 3UL
#define BLE_BLELL_ADV_INTR_SCAN_RSP_TX_INTR_Msk 0x8UL
#define BLE_BLELL_ADV_INTR_SCAN_REQ_RX_INTR_Pos 4UL
#define BLE_BLELL_ADV_INTR_SCAN_REQ_RX_INTR_Msk 0x10UL
#define BLE_BLELL_ADV_INTR_CONN_REQ_RX_INTR_Pos 5UL
#define BLE_BLELL_ADV_INTR_CONN_REQ_RX_INTR_Msk 0x20UL
#define BLE_BLELL_ADV_INTR_SLV_CONNECTED_Pos    6UL
#define BLE_BLELL_ADV_INTR_SLV_CONNECTED_Msk    0x40UL
#define BLE_BLELL_ADV_INTR_ADV_TIMEOUT_Pos      7UL
#define BLE_BLELL_ADV_INTR_ADV_TIMEOUT_Msk      0x80UL
#define BLE_BLELL_ADV_INTR_ADV_ON_Pos           8UL
#define BLE_BLELL_ADV_INTR_ADV_ON_Msk           0x100UL
#define BLE_BLELL_ADV_INTR_SLV_CONN_PEER_RPA_UNMCH_INTR_Pos 9UL
#define BLE_BLELL_ADV_INTR_SLV_CONN_PEER_RPA_UNMCH_INTR_Msk 0x200UL
#define BLE_BLELL_ADV_INTR_SCAN_REQ_RX_PEER_RPA_UNMCH_INTR_Pos 10UL
#define BLE_BLELL_ADV_INTR_SCAN_REQ_RX_PEER_RPA_UNMCH_INTR_Msk 0x400UL
#define BLE_BLELL_ADV_INTR_INIT_ADDR_MATCH_PRIV_MISMATCH_INTR_Pos 11UL
#define BLE_BLELL_ADV_INTR_INIT_ADDR_MATCH_PRIV_MISMATCH_INTR_Msk 0x800UL
#define BLE_BLELL_ADV_INTR_SCAN_ADDR_MATCH_PRIV_MISMATCH_INTR_Pos 12UL
#define BLE_BLELL_ADV_INTR_SCAN_ADDR_MATCH_PRIV_MISMATCH_INTR_Msk 0x1000UL
/* BLE_BLELL.ADV_NEXT_INSTANT */
#define BLE_BLELL_ADV_NEXT_INSTANT_ADV_NEXT_INSTANT_Pos 0UL
#define BLE_BLELL_ADV_NEXT_INSTANT_ADV_NEXT_INSTANT_Msk 0xFFFFUL
/* BLE_BLELL.SCAN_INTERVAL */
#define BLE_BLELL_SCAN_INTERVAL_SCAN_INTERVAL_Pos 0UL
#define BLE_BLELL_SCAN_INTERVAL_SCAN_INTERVAL_Msk 0xFFFFUL
/* BLE_BLELL.SCAN_WINDOW */
#define BLE_BLELL_SCAN_WINDOW_SCAN_WINDOW_Pos   0UL
#define BLE_BLELL_SCAN_WINDOW_SCAN_WINDOW_Msk   0xFFFFUL
/* BLE_BLELL.SCAN_PARAM */
#define BLE_BLELL_SCAN_PARAM_TX_ADDR_Pos        0UL
#define BLE_BLELL_SCAN_PARAM_TX_ADDR_Msk        0x1UL
#define BLE_BLELL_SCAN_PARAM_SCAN_TYPE_Pos      1UL
#define BLE_BLELL_SCAN_PARAM_SCAN_TYPE_Msk      0x6UL
#define BLE_BLELL_SCAN_PARAM_SCAN_FILT_POLICY_Pos 3UL
#define BLE_BLELL_SCAN_PARAM_SCAN_FILT_POLICY_Msk 0x18UL
#define BLE_BLELL_SCAN_PARAM_DUP_FILT_EN_Pos    5UL
#define BLE_BLELL_SCAN_PARAM_DUP_FILT_EN_Msk    0x20UL
#define BLE_BLELL_SCAN_PARAM_DUP_FILT_CHK_ADV_DIR_Pos 6UL
#define BLE_BLELL_SCAN_PARAM_DUP_FILT_CHK_ADV_DIR_Msk 0x40UL
#define BLE_BLELL_SCAN_PARAM_SCAN_RSP_ADVA_CHECK_Pos 7UL
#define BLE_BLELL_SCAN_PARAM_SCAN_RSP_ADVA_CHECK_Msk 0x80UL
#define BLE_BLELL_SCAN_PARAM_SCAN_RCV_IA_IN_PRIV_Pos 8UL
#define BLE_BLELL_SCAN_PARAM_SCAN_RCV_IA_IN_PRIV_Msk 0x100UL
#define BLE_BLELL_SCAN_PARAM_SCAN_RPT_PEER_NRPA_ADDR_IN_PRIV_Pos 9UL
#define BLE_BLELL_SCAN_PARAM_SCAN_RPT_PEER_NRPA_ADDR_IN_PRIV_Msk 0x200UL
/* BLE_BLELL.SCAN_INTR */
#define BLE_BLELL_SCAN_INTR_SCAN_STRT_INTR_Pos  0UL
#define BLE_BLELL_SCAN_INTR_SCAN_STRT_INTR_Msk  0x1UL
#define BLE_BLELL_SCAN_INTR_SCAN_CLOSE_INTR_Pos 1UL
#define BLE_BLELL_SCAN_INTR_SCAN_CLOSE_INTR_Msk 0x2UL
#define BLE_BLELL_SCAN_INTR_SCAN_TX_INTR_Pos    2UL
#define BLE_BLELL_SCAN_INTR_SCAN_TX_INTR_Msk    0x4UL
#define BLE_BLELL_SCAN_INTR_ADV_RX_INTR_Pos     3UL
#define BLE_BLELL_SCAN_INTR_ADV_RX_INTR_Msk     0x8UL
#define BLE_BLELL_SCAN_INTR_SCAN_RSP_RX_INTR_Pos 4UL
#define BLE_BLELL_SCAN_INTR_SCAN_RSP_RX_INTR_Msk 0x10UL
#define BLE_BLELL_SCAN_INTR_ADV_RX_PEER_RPA_UNMCH_INTR_Pos 5UL
#define BLE_BLELL_SCAN_INTR_ADV_RX_PEER_RPA_UNMCH_INTR_Msk 0x20UL
#define BLE_BLELL_SCAN_INTR_ADV_RX_SELF_RPA_UNMCH_INTR_Pos 6UL
#define BLE_BLELL_SCAN_INTR_ADV_RX_SELF_RPA_UNMCH_INTR_Msk 0x40UL
#define BLE_BLELL_SCAN_INTR_SCANA_TX_ADDR_NOT_SET_INTR_Pos 7UL
#define BLE_BLELL_SCAN_INTR_SCANA_TX_ADDR_NOT_SET_INTR_Msk 0x80UL
#define BLE_BLELL_SCAN_INTR_SCAN_ON_Pos         8UL
#define BLE_BLELL_SCAN_INTR_SCAN_ON_Msk         0x100UL
#define BLE_BLELL_SCAN_INTR_PEER_ADDR_MATCH_PRIV_MISMATCH_INTR_Pos 9UL
#define BLE_BLELL_SCAN_INTR_PEER_ADDR_MATCH_PRIV_MISMATCH_INTR_Msk 0x200UL
#define BLE_BLELL_SCAN_INTR_SELF_ADDR_MATCH_PRIV_MISMATCH_INTR_Pos 10UL
#define BLE_BLELL_SCAN_INTR_SELF_ADDR_MATCH_PRIV_MISMATCH_INTR_Msk 0x400UL
/* BLE_BLELL.SCAN_NEXT_INSTANT */
#define BLE_BLELL_SCAN_NEXT_INSTANT_NEXT_SCAN_INSTANT_Pos 0UL
#define BLE_BLELL_SCAN_NEXT_INSTANT_NEXT_SCAN_INSTANT_Msk 0xFFFFUL
/* BLE_BLELL.INIT_INTERVAL */
#define BLE_BLELL_INIT_INTERVAL_INIT_SCAN_INTERVAL_Pos 0UL
#define BLE_BLELL_INIT_INTERVAL_INIT_SCAN_INTERVAL_Msk 0xFFFFUL
/* BLE_BLELL.INIT_WINDOW */
#define BLE_BLELL_INIT_WINDOW_INIT_SCAN_WINDOW_Pos 0UL
#define BLE_BLELL_INIT_WINDOW_INIT_SCAN_WINDOW_Msk 0xFFFFUL
/* BLE_BLELL.INIT_PARAM */
#define BLE_BLELL_INIT_PARAM_TX_ADDR_Pos        0UL
#define BLE_BLELL_INIT_PARAM_TX_ADDR_Msk        0x1UL
#define BLE_BLELL_INIT_PARAM_RX_ADDR__RX_TX_ADDR_Pos 1UL
#define BLE_BLELL_INIT_PARAM_RX_ADDR__RX_TX_ADDR_Msk 0x2UL
#define BLE_BLELL_INIT_PARAM_INIT_FILT_POLICY_Pos 3UL
#define BLE_BLELL_INIT_PARAM_INIT_FILT_POLICY_Msk 0x8UL
#define BLE_BLELL_INIT_PARAM_INIT_RCV_IA_IN_PRIV_Pos 4UL
#define BLE_BLELL_INIT_PARAM_INIT_RCV_IA_IN_PRIV_Msk 0x10UL
/* BLE_BLELL.INIT_INTR */
#define BLE_BLELL_INIT_INTR_INIT_INTERVAL_EXPIRE_INTR_Pos 0UL
#define BLE_BLELL_INIT_INTR_INIT_INTERVAL_EXPIRE_INTR_Msk 0x1UL
#define BLE_BLELL_INIT_INTR_INIT_CLOSE_WINDOW_INR_Pos 1UL
#define BLE_BLELL_INIT_INTR_INIT_CLOSE_WINDOW_INR_Msk 0x2UL
#define BLE_BLELL_INIT_INTR_INIT_TX_START_INTR_Pos 2UL
#define BLE_BLELL_INIT_INTR_INIT_TX_START_INTR_Msk 0x4UL
#define BLE_BLELL_INIT_INTR_MASTER_CONN_CREATED_Pos 4UL
#define BLE_BLELL_INIT_INTR_MASTER_CONN_CREATED_Msk 0x10UL
#define BLE_BLELL_INIT_INTR_ADV_RX_SELF_ADDR_UNMCH_INTR_Pos 5UL
#define BLE_BLELL_INIT_INTR_ADV_RX_SELF_ADDR_UNMCH_INTR_Msk 0x20UL
#define BLE_BLELL_INIT_INTR_ADV_RX_PEER_ADDR_UNMCH_INTR_Pos 6UL
#define BLE_BLELL_INIT_INTR_ADV_RX_PEER_ADDR_UNMCH_INTR_Msk 0x40UL
#define BLE_BLELL_INIT_INTR_INITA_TX_ADDR_NOT_SET_INTR_Pos 7UL
#define BLE_BLELL_INIT_INTR_INITA_TX_ADDR_NOT_SET_INTR_Msk 0x80UL
#define BLE_BLELL_INIT_INTR_INI_PEER_ADDR_MATCH_PRIV_MISMATCH_INTR_Pos 8UL
#define BLE_BLELL_INIT_INTR_INI_PEER_ADDR_MATCH_PRIV_MISMATCH_INTR_Msk 0x100UL
#define BLE_BLELL_INIT_INTR_INI_SELF_ADDR_MATCH_PRIV_MISMATCH_INTR_Pos 9UL
#define BLE_BLELL_INIT_INTR_INI_SELF_ADDR_MATCH_PRIV_MISMATCH_INTR_Msk 0x200UL
/* BLE_BLELL.INIT_NEXT_INSTANT */
#define BLE_BLELL_INIT_NEXT_INSTANT_INIT_NEXT_INSTANT_Pos 0UL
#define BLE_BLELL_INIT_NEXT_INSTANT_INIT_NEXT_INSTANT_Msk 0xFFFFUL
/* BLE_BLELL.DEVICE_RAND_ADDR_L */
#define BLE_BLELL_DEVICE_RAND_ADDR_L_DEVICE_RAND_ADDR_L_Pos 0UL
#define BLE_BLELL_DEVICE_RAND_ADDR_L_DEVICE_RAND_ADDR_L_Msk 0xFFFFUL
/* BLE_BLELL.DEVICE_RAND_ADDR_M */
#define BLE_BLELL_DEVICE_RAND_ADDR_M_DEVICE_RAND_ADDR_M_Pos 0UL
#define BLE_BLELL_DEVICE_RAND_ADDR_M_DEVICE_RAND_ADDR_M_Msk 0xFFFFUL
/* BLE_BLELL.DEVICE_RAND_ADDR_H */
#define BLE_BLELL_DEVICE_RAND_ADDR_H_DEVICE_RAND_ADDR_H_Pos 0UL
#define BLE_BLELL_DEVICE_RAND_ADDR_H_DEVICE_RAND_ADDR_H_Msk 0xFFFFUL
/* BLE_BLELL.PEER_ADDR_L */
#define BLE_BLELL_PEER_ADDR_L_PEER_ADDR_L_Pos   0UL
#define BLE_BLELL_PEER_ADDR_L_PEER_ADDR_L_Msk   0xFFFFUL
/* BLE_BLELL.PEER_ADDR_M */
#define BLE_BLELL_PEER_ADDR_M_PEER_ADDR_M_Pos   0UL
#define BLE_BLELL_PEER_ADDR_M_PEER_ADDR_M_Msk   0xFFFFUL
/* BLE_BLELL.PEER_ADDR_H */
#define BLE_BLELL_PEER_ADDR_H_PEER_ADDR_H_Pos   0UL
#define BLE_BLELL_PEER_ADDR_H_PEER_ADDR_H_Msk   0xFFFFUL
/* BLE_BLELL.WL_ADDR_TYPE */
#define BLE_BLELL_WL_ADDR_TYPE_WL_ADDR_TYPE_Pos 0UL
#define BLE_BLELL_WL_ADDR_TYPE_WL_ADDR_TYPE_Msk 0xFFFFUL
/* BLE_BLELL.WL_ENABLE */
#define BLE_BLELL_WL_ENABLE_WL_ENABLE_Pos       0UL
#define BLE_BLELL_WL_ENABLE_WL_ENABLE_Msk       0xFFFFUL
/* BLE_BLELL.TRANSMIT_WINDOW_OFFSET */
#define BLE_BLELL_TRANSMIT_WINDOW_OFFSET_TX_WINDOW_OFFSET_Pos 0UL
#define BLE_BLELL_TRANSMIT_WINDOW_OFFSET_TX_WINDOW_OFFSET_Msk 0xFFFFUL
/* BLE_BLELL.TRANSMIT_WINDOW_SIZE */
#define BLE_BLELL_TRANSMIT_WINDOW_SIZE_TX_WINDOW_SIZE_Pos 0UL
#define BLE_BLELL_TRANSMIT_WINDOW_SIZE_TX_WINDOW_SIZE_Msk 0xFFUL
/* BLE_BLELL.DATA_CHANNELS_L0 */
#define BLE_BLELL_DATA_CHANNELS_L0_DATA_CHANNELS_L0_Pos 0UL
#define BLE_BLELL_DATA_CHANNELS_L0_DATA_CHANNELS_L0_Msk 0xFFFFUL
/* BLE_BLELL.DATA_CHANNELS_M0 */
#define BLE_BLELL_DATA_CHANNELS_M0_DATA_CHANNELS_M0_Pos 0UL
#define BLE_BLELL_DATA_CHANNELS_M0_DATA_CHANNELS_M0_Msk 0xFFFFUL
/* BLE_BLELL.DATA_CHANNELS_H0 */
#define BLE_BLELL_DATA_CHANNELS_H0_DATA_CHANNELS_H0_Pos 0UL
#define BLE_BLELL_DATA_CHANNELS_H0_DATA_CHANNELS_H0_Msk 0x1FUL
/* BLE_BLELL.DATA_CHANNELS_L1 */
#define BLE_BLELL_DATA_CHANNELS_L1_DATA_CHANNELS_L1_Pos 0UL
#define BLE_BLELL_DATA_CHANNELS_L1_DATA_CHANNELS_L1_Msk 0xFFFFUL
/* BLE_BLELL.DATA_CHANNELS_M1 */
#define BLE_BLELL_DATA_CHANNELS_M1_DATA_CHANNELS_M1_Pos 0UL
#define BLE_BLELL_DATA_CHANNELS_M1_DATA_CHANNELS_M1_Msk 0xFFFFUL
/* BLE_BLELL.DATA_CHANNELS_H1 */
#define BLE_BLELL_DATA_CHANNELS_H1_DATA_CHANNELS_H1_Pos 0UL
#define BLE_BLELL_DATA_CHANNELS_H1_DATA_CHANNELS_H1_Msk 0x1FUL
/* BLE_BLELL.CONN_INTR */
#define BLE_BLELL_CONN_INTR_CONN_CLOSED_Pos     0UL
#define BLE_BLELL_CONN_INTR_CONN_CLOSED_Msk     0x1UL
#define BLE_BLELL_CONN_INTR_CONN_ESTB_Pos       1UL
#define BLE_BLELL_CONN_INTR_CONN_ESTB_Msk       0x2UL
#define BLE_BLELL_CONN_INTR_MAP_UPDT_DONE_Pos   2UL
#define BLE_BLELL_CONN_INTR_MAP_UPDT_DONE_Msk   0x4UL
#define BLE_BLELL_CONN_INTR_START_CE_Pos        3UL
#define BLE_BLELL_CONN_INTR_START_CE_Msk        0x8UL
#define BLE_BLELL_CONN_INTR_CLOSE_CE_Pos        4UL
#define BLE_BLELL_CONN_INTR_CLOSE_CE_Msk        0x10UL
#define BLE_BLELL_CONN_INTR_CE_TX_ACK_Pos       5UL
#define BLE_BLELL_CONN_INTR_CE_TX_ACK_Msk       0x20UL
#define BLE_BLELL_CONN_INTR_CE_RX_Pos           6UL
#define BLE_BLELL_CONN_INTR_CE_RX_Msk           0x40UL
#define BLE_BLELL_CONN_INTR_CON_UPDT_DONE_Pos   7UL
#define BLE_BLELL_CONN_INTR_CON_UPDT_DONE_Msk   0x80UL
#define BLE_BLELL_CONN_INTR_DISCON_STATUS_Pos   8UL
#define BLE_BLELL_CONN_INTR_DISCON_STATUS_Msk   0x700UL
#define BLE_BLELL_CONN_INTR_RX_PDU_STATUS_Pos   11UL
#define BLE_BLELL_CONN_INTR_RX_PDU_STATUS_Msk   0x3800UL
#define BLE_BLELL_CONN_INTR_PING_TIMER_EXPIRD_INTR_Pos 14UL
#define BLE_BLELL_CONN_INTR_PING_TIMER_EXPIRD_INTR_Msk 0x4000UL
#define BLE_BLELL_CONN_INTR_PING_NEARLY_EXPIRD_INTR_Pos 15UL
#define BLE_BLELL_CONN_INTR_PING_NEARLY_EXPIRD_INTR_Msk 0x8000UL
/* BLE_BLELL.CONN_STATUS */
#define BLE_BLELL_CONN_STATUS_RECEIVE_PACKET_COUNT_Pos 12UL
#define BLE_BLELL_CONN_STATUS_RECEIVE_PACKET_COUNT_Msk 0xF000UL
/* BLE_BLELL.CONN_INDEX */
#define BLE_BLELL_CONN_INDEX_CONN_INDEX_Pos     0UL
#define BLE_BLELL_CONN_INDEX_CONN_INDEX_Msk     0xFFFFUL
/* BLE_BLELL.WAKEUP_CONFIG */
#define BLE_BLELL_WAKEUP_CONFIG_OSC_STARTUP_DELAY_Pos 0UL
#define BLE_BLELL_WAKEUP_CONFIG_OSC_STARTUP_DELAY_Msk 0xFFUL
#define BLE_BLELL_WAKEUP_CONFIG_DSM_OFFSET_TO_WAKEUP_INSTANT_Pos 10UL
#define BLE_BLELL_WAKEUP_CONFIG_DSM_OFFSET_TO_WAKEUP_INSTANT_Msk 0xFC00UL
/* BLE_BLELL.WAKEUP_CONTROL */
#define BLE_BLELL_WAKEUP_CONTROL_WAKEUP_INSTANT_Pos 0UL
#define BLE_BLELL_WAKEUP_CONTROL_WAKEUP_INSTANT_Msk 0xFFFFUL
/* BLE_BLELL.CLOCK_CONFIG */
#define BLE_BLELL_CLOCK_CONFIG_ADV_CLK_GATE_EN_Pos 0UL
#define BLE_BLELL_CLOCK_CONFIG_ADV_CLK_GATE_EN_Msk 0x1UL
#define BLE_BLELL_CLOCK_CONFIG_SCAN_CLK_GATE_EN_Pos 1UL
#define BLE_BLELL_CLOCK_CONFIG_SCAN_CLK_GATE_EN_Msk 0x2UL
#define BLE_BLELL_CLOCK_CONFIG_INIT_CLK_GATE_EN_Pos 2UL
#define BLE_BLELL_CLOCK_CONFIG_INIT_CLK_GATE_EN_Msk 0x4UL
#define BLE_BLELL_CLOCK_CONFIG_CONN_CLK_GATE_EN_Pos 3UL
#define BLE_BLELL_CLOCK_CONFIG_CONN_CLK_GATE_EN_Msk 0x8UL
#define BLE_BLELL_CLOCK_CONFIG_CORECLK_GATE_EN_Pos 4UL
#define BLE_BLELL_CLOCK_CONFIG_CORECLK_GATE_EN_Msk 0x10UL
#define BLE_BLELL_CLOCK_CONFIG_SYSCLK_GATE_EN_Pos 5UL
#define BLE_BLELL_CLOCK_CONFIG_SYSCLK_GATE_EN_Msk 0x20UL
#define BLE_BLELL_CLOCK_CONFIG_PHY_CLK_GATE_EN_Pos 6UL
#define BLE_BLELL_CLOCK_CONFIG_PHY_CLK_GATE_EN_Msk 0x40UL
#define BLE_BLELL_CLOCK_CONFIG_LLH_IDLE_Pos     7UL
#define BLE_BLELL_CLOCK_CONFIG_LLH_IDLE_Msk     0x80UL
#define BLE_BLELL_CLOCK_CONFIG_LPO_CLK_FREQ_SEL_Pos 8UL
#define BLE_BLELL_CLOCK_CONFIG_LPO_CLK_FREQ_SEL_Msk 0x100UL
#define BLE_BLELL_CLOCK_CONFIG_LPO_SEL_EXTERNAL_Pos 9UL
#define BLE_BLELL_CLOCK_CONFIG_LPO_SEL_EXTERNAL_Msk 0x200UL
#define BLE_BLELL_CLOCK_CONFIG_SM_AUTO_WKUP_EN_Pos 10UL
#define BLE_BLELL_CLOCK_CONFIG_SM_AUTO_WKUP_EN_Msk 0x400UL
#define BLE_BLELL_CLOCK_CONFIG_SM_INTR_EN_Pos   12UL
#define BLE_BLELL_CLOCK_CONFIG_SM_INTR_EN_Msk   0x1000UL
#define BLE_BLELL_CLOCK_CONFIG_DEEP_SLEEP_AUTO_WKUP_DISABLE_Pos 13UL
#define BLE_BLELL_CLOCK_CONFIG_DEEP_SLEEP_AUTO_WKUP_DISABLE_Msk 0x2000UL
#define BLE_BLELL_CLOCK_CONFIG_SLEEP_MODE_EN_Pos 14UL
#define BLE_BLELL_CLOCK_CONFIG_SLEEP_MODE_EN_Msk 0x4000UL
#define BLE_BLELL_CLOCK_CONFIG_DEEP_SLEEP_MODE_EN_Pos 15UL
#define BLE_BLELL_CLOCK_CONFIG_DEEP_SLEEP_MODE_EN_Msk 0x8000UL
/* BLE_BLELL.TIM_COUNTER_L */
#define BLE_BLELL_TIM_COUNTER_L_TIM_REF_CLOCK_Pos 0UL
#define BLE_BLELL_TIM_COUNTER_L_TIM_REF_CLOCK_Msk 0xFFFFUL
/* BLE_BLELL.WAKEUP_CONFIG_EXTD */
#define BLE_BLELL_WAKEUP_CONFIG_EXTD_DSM_LF_OFFSET_Pos 0UL
#define BLE_BLELL_WAKEUP_CONFIG_EXTD_DSM_LF_OFFSET_Msk 0x1FUL
/* BLE_BLELL.POC_REG__TIM_CONTROL */
#define BLE_BLELL_POC_REG__TIM_CONTROL_BB_CLK_FREQ_MINUS_1_Pos 3UL
#define BLE_BLELL_POC_REG__TIM_CONTROL_BB_CLK_FREQ_MINUS_1_Msk 0xF8UL
#define BLE_BLELL_POC_REG__TIM_CONTROL_START_SLOT_OFFSET_Pos 8UL
#define BLE_BLELL_POC_REG__TIM_CONTROL_START_SLOT_OFFSET_Msk 0xF00UL
/* BLE_BLELL.ADV_TX_DATA_FIFO */
#define BLE_BLELL_ADV_TX_DATA_FIFO_ADV_TX_DATA_Pos 0UL
#define BLE_BLELL_ADV_TX_DATA_FIFO_ADV_TX_DATA_Msk 0xFFFFUL
/* BLE_BLELL.ADV_SCN_RSP_TX_FIFO */
#define BLE_BLELL_ADV_SCN_RSP_TX_FIFO_SCAN_RSP_DATA_Pos 0UL
#define BLE_BLELL_ADV_SCN_RSP_TX_FIFO_SCAN_RSP_DATA_Msk 0xFFFFUL
/* BLE_BLELL.INIT_SCN_ADV_RX_FIFO */
#define BLE_BLELL_INIT_SCN_ADV_RX_FIFO_ADV_SCAN_RSP_RX_DATA_Pos 0UL
#define BLE_BLELL_INIT_SCN_ADV_RX_FIFO_ADV_SCAN_RSP_RX_DATA_Msk 0xFFFFUL
/* BLE_BLELL.CONN_INTERVAL */
#define BLE_BLELL_CONN_INTERVAL_CONNECTION_INTERVAL_Pos 0UL
#define BLE_BLELL_CONN_INTERVAL_CONNECTION_INTERVAL_Msk 0xFFFFUL
/* BLE_BLELL.SUP_TIMEOUT */
#define BLE_BLELL_SUP_TIMEOUT_SUPERVISION_TIMEOUT_Pos 0UL
#define BLE_BLELL_SUP_TIMEOUT_SUPERVISION_TIMEOUT_Msk 0xFFFFUL
/* BLE_BLELL.SLAVE_LATENCY */
#define BLE_BLELL_SLAVE_LATENCY_SLAVE_LATENCY_Pos 0UL
#define BLE_BLELL_SLAVE_LATENCY_SLAVE_LATENCY_Msk 0xFFFFUL
/* BLE_BLELL.CE_LENGTH */
#define BLE_BLELL_CE_LENGTH_CONNECTION_EVENT_LENGTH_Pos 0UL
#define BLE_BLELL_CE_LENGTH_CONNECTION_EVENT_LENGTH_Msk 0xFFFFUL
/* BLE_BLELL.PDU_ACCESS_ADDR_L_REGISTER */
#define BLE_BLELL_PDU_ACCESS_ADDR_L_REGISTER_PDU_ACCESS_ADDRESS_LOWER_BITS_Pos 0UL
#define BLE_BLELL_PDU_ACCESS_ADDR_L_REGISTER_PDU_ACCESS_ADDRESS_LOWER_BITS_Msk 0xFFFFUL
/* BLE_BLELL.PDU_ACCESS_ADDR_H_REGISTER */
#define BLE_BLELL_PDU_ACCESS_ADDR_H_REGISTER_PDU_ACCESS_ADDRESS_HIGHER_BITS_Pos 0UL
#define BLE_BLELL_PDU_ACCESS_ADDR_H_REGISTER_PDU_ACCESS_ADDRESS_HIGHER_BITS_Msk 0xFFFFUL
/* BLE_BLELL.CONN_CE_INSTANT */
#define BLE_BLELL_CONN_CE_INSTANT_CE_INSTANT_Pos 0UL
#define BLE_BLELL_CONN_CE_INSTANT_CE_INSTANT_Msk 0xFFFFUL
/* BLE_BLELL.CE_CNFG_STS_REGISTER */
#define BLE_BLELL_CE_CNFG_STS_REGISTER_DATA_LIST_INDEX_LAST_ACK_INDEX_Pos 0UL
#define BLE_BLELL_CE_CNFG_STS_REGISTER_DATA_LIST_INDEX_LAST_ACK_INDEX_Msk 0xFUL
#define BLE_BLELL_CE_CNFG_STS_REGISTER_DATA_LIST_HEAD_UP_Pos 4UL
#define BLE_BLELL_CE_CNFG_STS_REGISTER_DATA_LIST_HEAD_UP_Msk 0x10UL
#define BLE_BLELL_CE_CNFG_STS_REGISTER_SPARE_Pos 5UL
#define BLE_BLELL_CE_CNFG_STS_REGISTER_SPARE_Msk 0x20UL
#define BLE_BLELL_CE_CNFG_STS_REGISTER_MD_Pos   6UL
#define BLE_BLELL_CE_CNFG_STS_REGISTER_MD_Msk   0x40UL
#define BLE_BLELL_CE_CNFG_STS_REGISTER_MAP_INDEX__CURR_INDEX_Pos 7UL
#define BLE_BLELL_CE_CNFG_STS_REGISTER_MAP_INDEX__CURR_INDEX_Msk 0x80UL
#define BLE_BLELL_CE_CNFG_STS_REGISTER_PAUSE_DATA_Pos 8UL
#define BLE_BLELL_CE_CNFG_STS_REGISTER_PAUSE_DATA_Msk 0x100UL
#define BLE_BLELL_CE_CNFG_STS_REGISTER_CONN_ACTIVE_Pos 10UL
#define BLE_BLELL_CE_CNFG_STS_REGISTER_CONN_ACTIVE_Msk 0x400UL
#define BLE_BLELL_CE_CNFG_STS_REGISTER_CURRENT_PDU_INDEX_Pos 12UL
#define BLE_BLELL_CE_CNFG_STS_REGISTER_CURRENT_PDU_INDEX_Msk 0xF000UL
/* BLE_BLELL.NEXT_CE_INSTANT */
#define BLE_BLELL_NEXT_CE_INSTANT_NEXT_CE_INSTANT_Pos 0UL
#define BLE_BLELL_NEXT_CE_INSTANT_NEXT_CE_INSTANT_Msk 0xFFFFUL
/* BLE_BLELL.CONN_CE_COUNTER */
#define BLE_BLELL_CONN_CE_COUNTER_CONNECTION_EVENT_COUNTER_Pos 0UL
#define BLE_BLELL_CONN_CE_COUNTER_CONNECTION_EVENT_COUNTER_Msk 0xFFFFUL
/* BLE_BLELL.DATA_LIST_SENT_UPDATE__STATUS */
#define BLE_BLELL_DATA_LIST_SENT_UPDATE__STATUS_LIST_INDEX__TX_SENT_3_0_Pos 0UL
#define BLE_BLELL_DATA_LIST_SENT_UPDATE__STATUS_LIST_INDEX__TX_SENT_3_0_Msk 0xFUL
#define BLE_BLELL_DATA_LIST_SENT_UPDATE__STATUS_SET_CLEAR_Pos 7UL
#define BLE_BLELL_DATA_LIST_SENT_UPDATE__STATUS_SET_CLEAR_Msk 0x80UL
/* BLE_BLELL.DATA_LIST_ACK_UPDATE__STATUS */
#define BLE_BLELL_DATA_LIST_ACK_UPDATE__STATUS_LIST_INDEX__TX_ACK_3_0_Pos 0UL
#define BLE_BLELL_DATA_LIST_ACK_UPDATE__STATUS_LIST_INDEX__TX_ACK_3_0_Msk 0xFUL
#define BLE_BLELL_DATA_LIST_ACK_UPDATE__STATUS_SET_CLEAR_Pos 7UL
#define BLE_BLELL_DATA_LIST_ACK_UPDATE__STATUS_SET_CLEAR_Msk 0x80UL
/* BLE_BLELL.CE_CNFG_STS_REGISTER_EXT */
#define BLE_BLELL_CE_CNFG_STS_REGISTER_EXT_TX_2M_Pos 0UL
#define BLE_BLELL_CE_CNFG_STS_REGISTER_EXT_TX_2M_Msk 0x1UL
#define BLE_BLELL_CE_CNFG_STS_REGISTER_EXT_RX_2M_Pos 1UL
#define BLE_BLELL_CE_CNFG_STS_REGISTER_EXT_RX_2M_Msk 0x2UL
#define BLE_BLELL_CE_CNFG_STS_REGISTER_EXT_SN_Pos 2UL
#define BLE_BLELL_CE_CNFG_STS_REGISTER_EXT_SN_Msk 0x4UL
#define BLE_BLELL_CE_CNFG_STS_REGISTER_EXT_NESN_Pos 3UL
#define BLE_BLELL_CE_CNFG_STS_REGISTER_EXT_NESN_Msk 0x8UL
#define BLE_BLELL_CE_CNFG_STS_REGISTER_EXT_LAST_UNMAPPED_CHANNEL_Pos 8UL
#define BLE_BLELL_CE_CNFG_STS_REGISTER_EXT_LAST_UNMAPPED_CHANNEL_Msk 0x3F00UL
/* BLE_BLELL.CONN_EXT_INTR */
#define BLE_BLELL_CONN_EXT_INTR_DATARATE_UPDATE_Pos 0UL
#define BLE_BLELL_CONN_EXT_INTR_DATARATE_UPDATE_Msk 0x1UL
#define BLE_BLELL_CONN_EXT_INTR_EARLY_INTR_Pos  1UL
#define BLE_BLELL_CONN_EXT_INTR_EARLY_INTR_Msk  0x2UL
#define BLE_BLELL_CONN_EXT_INTR_GEN_TIMER_INTR_Pos 2UL
#define BLE_BLELL_CONN_EXT_INTR_GEN_TIMER_INTR_Msk 0x4UL
/* BLE_BLELL.CONN_EXT_INTR_MASK */
#define BLE_BLELL_CONN_EXT_INTR_MASK_DATARATE_UPDATE_Pos 0UL
#define BLE_BLELL_CONN_EXT_INTR_MASK_DATARATE_UPDATE_Msk 0x1UL
#define BLE_BLELL_CONN_EXT_INTR_MASK_EARLY_INTR_Pos 1UL
#define BLE_BLELL_CONN_EXT_INTR_MASK_EARLY_INTR_Msk 0x2UL
#define BLE_BLELL_CONN_EXT_INTR_MASK_GEN_TIMER_INTR_Pos 2UL
#define BLE_BLELL_CONN_EXT_INTR_MASK_GEN_TIMER_INTR_Msk 0x4UL
/* BLE_BLELL.DATA_MEM_DESCRIPTOR */
#define BLE_BLELL_DATA_MEM_DESCRIPTOR_LLID_Pos  0UL
#define BLE_BLELL_DATA_MEM_DESCRIPTOR_LLID_Msk  0x3UL
#define BLE_BLELL_DATA_MEM_DESCRIPTOR_DATA_LENGTH_Pos 2UL
#define BLE_BLELL_DATA_MEM_DESCRIPTOR_DATA_LENGTH_Msk 0x3FCUL
/* BLE_BLELL.WINDOW_WIDEN_INTVL */
#define BLE_BLELL_WINDOW_WIDEN_INTVL_WINDOW_WIDEN_INTVL_Pos 0UL
#define BLE_BLELL_WINDOW_WIDEN_INTVL_WINDOW_WIDEN_INTVL_Msk 0xFFFUL
/* BLE_BLELL.WINDOW_WIDEN_WINOFF */
#define BLE_BLELL_WINDOW_WIDEN_WINOFF_WINDOW_WIDEN_WINOFF_Pos 0UL
#define BLE_BLELL_WINDOW_WIDEN_WINOFF_WINDOW_WIDEN_WINOFF_Msk 0xFFFUL
/* BLE_BLELL.LE_RF_TEST_MODE */
#define BLE_BLELL_LE_RF_TEST_MODE_TEST_FREQUENCY_Pos 0UL
#define BLE_BLELL_LE_RF_TEST_MODE_TEST_FREQUENCY_Msk 0x3FUL
#define BLE_BLELL_LE_RF_TEST_MODE_DTM_STATUS__DTM_CONT_RXEN_Pos 6UL
#define BLE_BLELL_LE_RF_TEST_MODE_DTM_STATUS__DTM_CONT_RXEN_Msk 0x40UL
#define BLE_BLELL_LE_RF_TEST_MODE_PKT_PAYLOAD_Pos 7UL
#define BLE_BLELL_LE_RF_TEST_MODE_PKT_PAYLOAD_Msk 0x380UL
#define BLE_BLELL_LE_RF_TEST_MODE_DTM_CONT_TXEN_Pos 13UL
#define BLE_BLELL_LE_RF_TEST_MODE_DTM_CONT_TXEN_Msk 0x2000UL
#define BLE_BLELL_LE_RF_TEST_MODE_DTM_DATA_2MBPS_Pos 15UL
#define BLE_BLELL_LE_RF_TEST_MODE_DTM_DATA_2MBPS_Msk 0x8000UL
/* BLE_BLELL.DTM_RX_PKT_COUNT */
#define BLE_BLELL_DTM_RX_PKT_COUNT_RX_PACKET_COUNT_Pos 0UL
#define BLE_BLELL_DTM_RX_PKT_COUNT_RX_PACKET_COUNT_Msk 0xFFFFUL
/* BLE_BLELL.LE_RF_TEST_MODE_EXT */
#define BLE_BLELL_LE_RF_TEST_MODE_EXT_DTM_PACKET_LENGTH_Pos 0UL
#define BLE_BLELL_LE_RF_TEST_MODE_EXT_DTM_PACKET_LENGTH_Msk 0xFFUL
/* BLE_BLELL.TXRX_HOP */
#define BLE_BLELL_TXRX_HOP_HOP_CH_TX_Pos        0UL
#define BLE_BLELL_TXRX_HOP_HOP_CH_TX_Msk        0x7FUL
#define BLE_BLELL_TXRX_HOP_HOP_CH_RX_Pos        8UL
#define BLE_BLELL_TXRX_HOP_HOP_CH_RX_Msk        0x7F00UL
/* BLE_BLELL.TX_RX_ON_DELAY */
#define BLE_BLELL_TX_RX_ON_DELAY_RXON_DELAY_Pos 0UL
