ARMmbed/mbed-os/targets/TARGET_Cypress/TARGET_PSOC6/psoc6pdl/devices/include/ip/cyip_ble.h
#define BLE_BLELL_TX_RX_ON_DELAY_RXON_DELAY_Msk 0xFFUL
#define BLE_BLELL_TX_RX_ON_DELAY_TXON_DELAY_Pos 8UL
#define BLE_BLELL_TX_RX_ON_DELAY_TXON_DELAY_Msk 0xFF00UL
/* BLE_BLELL.ADV_ACCADDR_L */
#define BLE_BLELL_ADV_ACCADDR_L_ADV_ACCADDR_L_Pos 0UL
#define BLE_BLELL_ADV_ACCADDR_L_ADV_ACCADDR_L_Msk 0xFFFFUL
/* BLE_BLELL.ADV_ACCADDR_H */
#define BLE_BLELL_ADV_ACCADDR_H_ADV_ACCADDR_H_Pos 0UL
#define BLE_BLELL_ADV_ACCADDR_H_ADV_ACCADDR_H_Msk 0xFFFFUL
/* BLE_BLELL.ADV_CH_TX_POWER_LVL_LS */
#define BLE_BLELL_ADV_CH_TX_POWER_LVL_LS_ADV_TRANSMIT_POWER_LVL_LS_Pos 0UL
#define BLE_BLELL_ADV_CH_TX_POWER_LVL_LS_ADV_TRANSMIT_POWER_LVL_LS_Msk 0xFFFFUL
/* BLE_BLELL.ADV_CH_TX_POWER_LVL_MS */
#define BLE_BLELL_ADV_CH_TX_POWER_LVL_MS_ADV_TRANSMIT_POWER_LVL_MS_Pos 0UL
#define BLE_BLELL_ADV_CH_TX_POWER_LVL_MS_ADV_TRANSMIT_POWER_LVL_MS_Msk 0x3UL
/* BLE_BLELL.CONN_CH_TX_POWER_LVL_LS */
#define BLE_BLELL_CONN_CH_TX_POWER_LVL_LS_CONNCH_TRANSMIT_POWER_LVL_LS_Pos 0UL
#define BLE_BLELL_CONN_CH_TX_POWER_LVL_LS_CONNCH_TRANSMIT_POWER_LVL_LS_Msk 0xFFFFUL
/* BLE_BLELL.CONN_CH_TX_POWER_LVL_MS */
#define BLE_BLELL_CONN_CH_TX_POWER_LVL_MS_CONNCH_TRANSMIT_POWER_LVL_MS_Pos 0UL
#define BLE_BLELL_CONN_CH_TX_POWER_LVL_MS_CONNCH_TRANSMIT_POWER_LVL_MS_Msk 0x3UL
/* BLE_BLELL.DEV_PUB_ADDR_L */
#define BLE_BLELL_DEV_PUB_ADDR_L_DEV_PUB_ADDR_L_Pos 0UL
#define BLE_BLELL_DEV_PUB_ADDR_L_DEV_PUB_ADDR_L_Msk 0xFFFFUL
/* BLE_BLELL.DEV_PUB_ADDR_M */
#define BLE_BLELL_DEV_PUB_ADDR_M_DEV_PUB_ADDR_M_Pos 0UL
#define BLE_BLELL_DEV_PUB_ADDR_M_DEV_PUB_ADDR_M_Msk 0xFFFFUL
/* BLE_BLELL.DEV_PUB_ADDR_H */
#define BLE_BLELL_DEV_PUB_ADDR_H_DEV_PUB_ADDR_H_Pos 0UL
#define BLE_BLELL_DEV_PUB_ADDR_H_DEV_PUB_ADDR_H_Msk 0xFFFFUL
/* BLE_BLELL.OFFSET_TO_FIRST_INSTANT */
#define BLE_BLELL_OFFSET_TO_FIRST_INSTANT_OFFSET_TO_FIRST_EVENT_Pos 0UL
#define BLE_BLELL_OFFSET_TO_FIRST_INSTANT_OFFSET_TO_FIRST_EVENT_Msk 0xFFFFUL
/* BLE_BLELL.ADV_CONFIG */
#define BLE_BLELL_ADV_CONFIG_ADV_STRT_EN_Pos    0UL
#define BLE_BLELL_ADV_CONFIG_ADV_STRT_EN_Msk    0x1UL
#define BLE_BLELL_ADV_CONFIG_ADV_CLS_EN_Pos     1UL
#define BLE_BLELL_ADV_CONFIG_ADV_CLS_EN_Msk     0x2UL
#define BLE_BLELL_ADV_CONFIG_ADV_TX_EN_Pos      2UL
#define BLE_BLELL_ADV_CONFIG_ADV_TX_EN_Msk      0x4UL
#define BLE_BLELL_ADV_CONFIG_SCN_RSP_TX_EN_Pos  3UL
#define BLE_BLELL_ADV_CONFIG_SCN_RSP_TX_EN_Msk  0x8UL
#define BLE_BLELL_ADV_CONFIG_ADV_SCN_REQ_RX_EN_Pos 4UL
#define BLE_BLELL_ADV_CONFIG_ADV_SCN_REQ_RX_EN_Msk 0x10UL
#define BLE_BLELL_ADV_CONFIG_ADV_CONN_REQ_RX_EN_Pos 5UL
#define BLE_BLELL_ADV_CONFIG_ADV_CONN_REQ_RX_EN_Msk 0x20UL
#define BLE_BLELL_ADV_CONFIG_SLV_CONNECTED_EN_Pos 6UL
#define BLE_BLELL_ADV_CONFIG_SLV_CONNECTED_EN_Msk 0x40UL
#define BLE_BLELL_ADV_CONFIG_ADV_TIMEOUT_EN_Pos 7UL
#define BLE_BLELL_ADV_CONFIG_ADV_TIMEOUT_EN_Msk 0x80UL
#define BLE_BLELL_ADV_CONFIG_ADV_RAND_DISABLE_Pos 8UL
#define BLE_BLELL_ADV_CONFIG_ADV_RAND_DISABLE_Msk 0x100UL
#define BLE_BLELL_ADV_CONFIG_ADV_SCN_PEER_RPA_UNMCH_EN_Pos 9UL
#define BLE_BLELL_ADV_CONFIG_ADV_SCN_PEER_RPA_UNMCH_EN_Msk 0x200UL
#define BLE_BLELL_ADV_CONFIG_ADV_CONN_PEER_RPA_UNMCH_EN_Pos 10UL
#define BLE_BLELL_ADV_CONFIG_ADV_CONN_PEER_RPA_UNMCH_EN_Msk 0x400UL
#define BLE_BLELL_ADV_CONFIG_ADV_PKT_INTERVAL_Pos 11UL
#define BLE_BLELL_ADV_CONFIG_ADV_PKT_INTERVAL_Msk 0xF800UL
/* BLE_BLELL.SCAN_CONFIG */
#define BLE_BLELL_SCAN_CONFIG_SCN_STRT_EN_Pos   0UL
#define BLE_BLELL_SCAN_CONFIG_SCN_STRT_EN_Msk   0x1UL
#define BLE_BLELL_SCAN_CONFIG_SCN_CLOSE_EN_Pos  1UL
#define BLE_BLELL_SCAN_CONFIG_SCN_CLOSE_EN_Msk  0x2UL
#define BLE_BLELL_SCAN_CONFIG_SCN_TX_EN_Pos     2UL
#define BLE_BLELL_SCAN_CONFIG_SCN_TX_EN_Msk     0x4UL
#define BLE_BLELL_SCAN_CONFIG_ADV_RX_EN_Pos     3UL
#define BLE_BLELL_SCAN_CONFIG_ADV_RX_EN_Msk     0x8UL
#define BLE_BLELL_SCAN_CONFIG_SCN_RSP_RX_EN_Pos 4UL
#define BLE_BLELL_SCAN_CONFIG_SCN_RSP_RX_EN_Msk 0x10UL
#define BLE_BLELL_SCAN_CONFIG_SCN_ADV_RX_INTR_PEER_RPA_UNMCH_EN_Pos 5UL
#define BLE_BLELL_SCAN_CONFIG_SCN_ADV_RX_INTR_PEER_RPA_UNMCH_EN_Msk 0x20UL
#define BLE_BLELL_SCAN_CONFIG_SCN_ADV_RX_INTR_SELF_RPA_UNMCH_EN_Pos 6UL
#define BLE_BLELL_SCAN_CONFIG_SCN_ADV_RX_INTR_SELF_RPA_UNMCH_EN_Msk 0x40UL
#define BLE_BLELL_SCAN_CONFIG_SCANA_TX_ADDR_NOT_SET_INTR_EN_Pos 7UL
#define BLE_BLELL_SCAN_CONFIG_SCANA_TX_ADDR_NOT_SET_INTR_EN_Msk 0x80UL
#define BLE_BLELL_SCAN_CONFIG_RPT_SELF_ADDR_MATCH_PRIV_MISMATCH_SCN_Pos 8UL
#define BLE_BLELL_SCAN_CONFIG_RPT_SELF_ADDR_MATCH_PRIV_MISMATCH_SCN_Msk 0x100UL
#define BLE_BLELL_SCAN_CONFIG_BACKOFF_ENABLE_Pos 11UL
#define BLE_BLELL_SCAN_CONFIG_BACKOFF_ENABLE_Msk 0x800UL
#define BLE_BLELL_SCAN_CONFIG_SCAN_CHANNEL_MAP_Pos 13UL
#define BLE_BLELL_SCAN_CONFIG_SCAN_CHANNEL_MAP_Msk 0xE000UL
/* BLE_BLELL.INIT_CONFIG */
#define BLE_BLELL_INIT_CONFIG_INIT_STRT_EN_Pos  0UL
#define BLE_BLELL_INIT_CONFIG_INIT_STRT_EN_Msk  0x1UL
#define BLE_BLELL_INIT_CONFIG_INIT_CLOSE_EN_Pos 1UL
#define BLE_BLELL_INIT_CONFIG_INIT_CLOSE_EN_Msk 0x2UL
#define BLE_BLELL_INIT_CONFIG_CONN_REQ_TX_EN_Pos 2UL
#define BLE_BLELL_INIT_CONFIG_CONN_REQ_TX_EN_Msk 0x4UL
#define BLE_BLELL_INIT_CONFIG_CONN_CREATED_Pos  4UL
#define BLE_BLELL_INIT_CONFIG_CONN_CREATED_Msk  0x10UL
#define BLE_BLELL_INIT_CONFIG_INIT_ADV_RX_INTR_SELF_RPA_UNRES_EN_Pos 5UL
#define BLE_BLELL_INIT_CONFIG_INIT_ADV_RX_INTR_SELF_RPA_UNRES_EN_Msk 0x20UL
#define BLE_BLELL_INIT_CONFIG_INIT_ADV_RX_INTR_PEER_RPA_UNRES_EN_Pos 6UL
#define BLE_BLELL_INIT_CONFIG_INIT_ADV_RX_INTR_PEER_RPA_UNRES_EN_Msk 0x40UL
#define BLE_BLELL_INIT_CONFIG_INITA_TX_ADDR_NOT_SET_INTR_EN_Pos 7UL
#define BLE_BLELL_INIT_CONFIG_INITA_TX_ADDR_NOT_SET_INTR_EN_Msk 0x80UL
#define BLE_BLELL_INIT_CONFIG_INIT_CHANNEL_MAP_Pos 13UL
#define BLE_BLELL_INIT_CONFIG_INIT_CHANNEL_MAP_Msk 0xE000UL
/* BLE_BLELL.CONN_CONFIG */
#define BLE_BLELL_CONN_CONFIG_RX_PKT_LIMIT_Pos  0UL
#define BLE_BLELL_CONN_CONFIG_RX_PKT_LIMIT_Msk  0xFUL
#define BLE_BLELL_CONN_CONFIG_RX_INTR_THRESHOLD_Pos 4UL
#define BLE_BLELL_CONN_CONFIG_RX_INTR_THRESHOLD_Msk 0xF0UL
#define BLE_BLELL_CONN_CONFIG_MD_BIT_CLEAR_Pos  8UL
#define BLE_BLELL_CONN_CONFIG_MD_BIT_CLEAR_Msk  0x100UL
#define BLE_BLELL_CONN_CONFIG_DSM_SLOT_VARIANCE_Pos 11UL
#define BLE_BLELL_CONN_CONFIG_DSM_SLOT_VARIANCE_Msk 0x800UL
#define BLE_BLELL_CONN_CONFIG_SLV_MD_CONFIG_Pos 12UL
#define BLE_BLELL_CONN_CONFIG_SLV_MD_CONFIG_Msk 0x1000UL
#define BLE_BLELL_CONN_CONFIG_EXTEND_CU_TX_WIN_Pos 13UL
#define BLE_BLELL_CONN_CONFIG_EXTEND_CU_TX_WIN_Msk 0x2000UL
#define BLE_BLELL_CONN_CONFIG_MASK_SUTO_AT_UPDT_Pos 14UL
#define BLE_BLELL_CONN_CONFIG_MASK_SUTO_AT_UPDT_Msk 0x4000UL
#define BLE_BLELL_CONN_CONFIG_CONN_REQ_1SLOT_EARLY_Pos 15UL
#define BLE_BLELL_CONN_CONFIG_CONN_REQ_1SLOT_EARLY_Msk 0x8000UL
/* BLE_BLELL.CONN_PARAM1 */
#define BLE_BLELL_CONN_PARAM1_SCA_PARAM_Pos     0UL
#define BLE_BLELL_CONN_PARAM1_SCA_PARAM_Msk     0x7UL
#define BLE_BLELL_CONN_PARAM1_HOP_INCREMENT_PARAM_Pos 3UL
#define BLE_BLELL_CONN_PARAM1_HOP_INCREMENT_PARAM_Msk 0xF8UL
#define BLE_BLELL_CONN_PARAM1_CRC_INIT_L_Pos    8UL
#define BLE_BLELL_CONN_PARAM1_CRC_INIT_L_Msk    0xFF00UL
/* BLE_BLELL.CONN_PARAM2 */
#define BLE_BLELL_CONN_PARAM2_CRC_INIT_H_Pos    0UL
#define BLE_BLELL_CONN_PARAM2_CRC_INIT_H_Msk    0xFFFFUL
/* BLE_BLELL.CONN_INTR_MASK */
#define BLE_BLELL_CONN_INTR_MASK_CONN_CL_INT_EN_Pos 0UL
#define BLE_BLELL_CONN_INTR_MASK_CONN_CL_INT_EN_Msk 0x1UL
#define BLE_BLELL_CONN_INTR_MASK_CONN_ESTB_INT_EN_Pos 1UL
#define BLE_BLELL_CONN_INTR_MASK_CONN_ESTB_INT_EN_Msk 0x2UL
#define BLE_BLELL_CONN_INTR_MASK_MAP_UPDT_INT_EN_Pos 2UL
#define BLE_BLELL_CONN_INTR_MASK_MAP_UPDT_INT_EN_Msk 0x4UL
#define BLE_BLELL_CONN_INTR_MASK_START_CE_INT_EN_Pos 3UL
#define BLE_BLELL_CONN_INTR_MASK_START_CE_INT_EN_Msk 0x8UL
#define BLE_BLELL_CONN_INTR_MASK_CLOSE_CE_INT_EN_Pos 4UL
#define BLE_BLELL_CONN_INTR_MASK_CLOSE_CE_INT_EN_Msk 0x10UL
#define BLE_BLELL_CONN_INTR_MASK_CE_TX_ACK_INT_EN_Pos 5UL
#define BLE_BLELL_CONN_INTR_MASK_CE_TX_ACK_INT_EN_Msk 0x20UL
#define BLE_BLELL_CONN_INTR_MASK_CE_RX_INT_EN_Pos 6UL
#define BLE_BLELL_CONN_INTR_MASK_CE_RX_INT_EN_Msk 0x40UL
#define BLE_BLELL_CONN_INTR_MASK_CONN_UPDATE_INTR_EN_Pos 7UL
#define BLE_BLELL_CONN_INTR_MASK_CONN_UPDATE_INTR_EN_Msk 0x80UL
#define BLE_BLELL_CONN_INTR_MASK_RX_GOOD_PDU_INT_EN_Pos 8UL
#define BLE_BLELL_CONN_INTR_MASK_RX_GOOD_PDU_INT_EN_Msk 0x100UL
#define BLE_BLELL_CONN_INTR_MASK_RX_BAD_PDU_INT_EN_Pos 9UL
#define BLE_BLELL_CONN_INTR_MASK_RX_BAD_PDU_INT_EN_Msk 0x200UL
#define BLE_BLELL_CONN_INTR_MASK_CE_CLOSE_NULL_RX_INT_EN_Pos 13UL
#define BLE_BLELL_CONN_INTR_MASK_CE_CLOSE_NULL_RX_INT_EN_Msk 0x2000UL
#define BLE_BLELL_CONN_INTR_MASK_PING_TIMER_EXPIRD_INTR_Pos 14UL
#define BLE_BLELL_CONN_INTR_MASK_PING_TIMER_EXPIRD_INTR_Msk 0x4000UL
#define BLE_BLELL_CONN_INTR_MASK_PING_NEARLY_EXPIRD_INTR_Pos 15UL
#define BLE_BLELL_CONN_INTR_MASK_PING_NEARLY_EXPIRD_INTR_Msk 0x8000UL
/* BLE_BLELL.SLAVE_TIMING_CONTROL */
#define BLE_BLELL_SLAVE_TIMING_CONTROL_SLAVE_TIME_SET_VAL_Pos 0UL
#define BLE_BLELL_SLAVE_TIMING_CONTROL_SLAVE_TIME_SET_VAL_Msk 0xFFUL
#define BLE_BLELL_SLAVE_TIMING_CONTROL_SLAVE_TIME_ADJ_VAL_Pos 8UL
#define BLE_BLELL_SLAVE_TIMING_CONTROL_SLAVE_TIME_ADJ_VAL_Msk 0xFF00UL
/* BLE_BLELL.RECEIVE_TRIG_CTRL */
#define BLE_BLELL_RECEIVE_TRIG_CTRL_ACC_TRIGGER_THRESHOLD_Pos 0UL
#define BLE_BLELL_RECEIVE_TRIG_CTRL_ACC_TRIGGER_THRESHOLD_Msk 0x3FUL
#define BLE_BLELL_RECEIVE_TRIG_CTRL_ACC_TRIGGER_TIMEOUT_Pos 8UL
#define BLE_BLELL_RECEIVE_TRIG_CTRL_ACC_TRIGGER_TIMEOUT_Msk 0xFF00UL
/* BLE_BLELL.LL_DBG_1 */
#define BLE_BLELL_LL_DBG_1_CONN_RX_WR_PTR_Pos   0UL
#define BLE_BLELL_LL_DBG_1_CONN_RX_WR_PTR_Msk   0x3FFUL
/* BLE_BLELL.LL_DBG_2 */
#define BLE_BLELL_LL_DBG_2_CONN_RX_RD_PTR_Pos   0UL
#define BLE_BLELL_LL_DBG_2_CONN_RX_RD_PTR_Msk   0x3FFUL
/* BLE_BLELL.LL_DBG_3 */
#define BLE_BLELL_LL_DBG_3_CONN_RX_WR_PTR_STORE_Pos 0UL
#define BLE_BLELL_LL_DBG_3_CONN_RX_WR_PTR_STORE_Msk 0x3FFUL
/* BLE_BLELL.LL_DBG_4 */
#define BLE_BLELL_LL_DBG_4_CONNECTION_FSM_STATE_Pos 0UL
#define BLE_BLELL_LL_DBG_4_CONNECTION_FSM_STATE_Msk 0xFUL
#define BLE_BLELL_LL_DBG_4_SLAVE_LATENCY_FSM_STATE_Pos 4UL
#define BLE_BLELL_LL_DBG_4_SLAVE_LATENCY_FSM_STATE_Msk 0x30UL
#define BLE_BLELL_LL_DBG_4_ADVERTISER_FSM_STATE_Pos 6UL
#define BLE_BLELL_LL_DBG_4_ADVERTISER_FSM_STATE_Msk 0x7C0UL
/* BLE_BLELL.LL_DBG_5 */
#define BLE_BLELL_LL_DBG_5_INIT_FSM_STATE_Pos   0UL
#define BLE_BLELL_LL_DBG_5_INIT_FSM_STATE_Msk   0x1FUL
#define BLE_BLELL_LL_DBG_5_SCAN_FSM_STATE_Pos   5UL
#define BLE_BLELL_LL_DBG_5_SCAN_FSM_STATE_Msk   0x3E0UL
/* BLE_BLELL.LL_DBG_6 */
#define BLE_BLELL_LL_DBG_6_ADV_TX_WR_PTR_Pos    0UL
#define BLE_BLELL_LL_DBG_6_ADV_TX_WR_PTR_Msk    0xFUL
#define BLE_BLELL_LL_DBG_6_SCAN_RSP_TX_WR_PTR_Pos 4UL
#define BLE_BLELL_LL_DBG_6_SCAN_RSP_TX_WR_PTR_Msk 0xF0UL
#define BLE_BLELL_LL_DBG_6_ADV_TX_RD_PTR_Pos    8UL
#define BLE_BLELL_LL_DBG_6_ADV_TX_RD_PTR_Msk    0x3F00UL
/* BLE_BLELL.LL_DBG_7 */
#define BLE_BLELL_LL_DBG_7_ADV_RX_WR_PTR_Pos    0UL
#define BLE_BLELL_LL_DBG_7_ADV_RX_WR_PTR_Msk    0x7FUL
#define BLE_BLELL_LL_DBG_7_ADV_RX_RD_PTR_Pos    7UL
#define BLE_BLELL_LL_DBG_7_ADV_RX_RD_PTR_Msk    0x3F80UL
/* BLE_BLELL.LL_DBG_8 */
#define BLE_BLELL_LL_DBG_8_ADV_RX_WR_PTR_STORE_Pos 0UL
#define BLE_BLELL_LL_DBG_8_ADV_RX_WR_PTR_STORE_Msk 0x7FUL
#define BLE_BLELL_LL_DBG_8_WLF_PTR_Pos          7UL
#define BLE_BLELL_LL_DBG_8_WLF_PTR_Msk          0x3F80UL
/* BLE_BLELL.LL_DBG_9 */
#define BLE_BLELL_LL_DBG_9_WINDOW_WIDEN_Pos     0UL
#define BLE_BLELL_LL_DBG_9_WINDOW_WIDEN_Msk     0xFFFFUL
/* BLE_BLELL.LL_DBG_10 */
#define BLE_BLELL_LL_DBG_10_RF_CHANNEL_NUM_Pos  0UL
#define BLE_BLELL_LL_DBG_10_RF_CHANNEL_NUM_Msk  0x3FUL
/* BLE_BLELL.PEER_ADDR_INIT_L */
#define BLE_BLELL_PEER_ADDR_INIT_L_PEER_ADDR_L_Pos 0UL
#define BLE_BLELL_PEER_ADDR_INIT_L_PEER_ADDR_L_Msk 0xFFFFUL
/* BLE_BLELL.PEER_ADDR_INIT_M */
#define BLE_BLELL_PEER_ADDR_INIT_M_PEER_ADDR_M_Pos 0UL
#define BLE_BLELL_PEER_ADDR_INIT_M_PEER_ADDR_M_Msk 0xFFFFUL
/* BLE_BLELL.PEER_ADDR_INIT_H */
#define BLE_BLELL_PEER_ADDR_INIT_H_PEER_ADDR_H_Pos 0UL
#define BLE_BLELL_PEER_ADDR_INIT_H_PEER_ADDR_H_Msk 0xFFFFUL
/* BLE_BLELL.PEER_SEC_ADDR_ADV_L */
#define BLE_BLELL_PEER_SEC_ADDR_ADV_L_PEER_SEC_ADDR_L_Pos 0UL
#define BLE_BLELL_PEER_SEC_ADDR_ADV_L_PEER_SEC_ADDR_L_Msk 0xFFFFUL
/* BLE_BLELL.PEER_SEC_ADDR_ADV_M */
#define BLE_BLELL_PEER_SEC_ADDR_ADV_M_PEER_SEC_ADDR_M_Pos 0UL
#define BLE_BLELL_PEER_SEC_ADDR_ADV_M_PEER_SEC_ADDR_M_Msk 0xFFFFUL
/* BLE_BLELL.PEER_SEC_ADDR_ADV_H */
#define BLE_BLELL_PEER_SEC_ADDR_ADV_H_PEER_SEC_ADDR_H_Pos 0UL
#define BLE_BLELL_PEER_SEC_ADDR_ADV_H_PEER_SEC_ADDR_H_Msk 0xFFFFUL
/* BLE_BLELL.INIT_WINDOW_TIMER_CTRL */
#define BLE_BLELL_INIT_WINDOW_TIMER_CTRL_INIT_WINDOW_OFFSET_SEL_Pos 0UL
#define BLE_BLELL_INIT_WINDOW_TIMER_CTRL_INIT_WINDOW_OFFSET_SEL_Msk 0x1UL
/* BLE_BLELL.CONN_CONFIG_EXT */
#define BLE_BLELL_CONN_CONFIG_EXT_CONN_REQ_2SLOT_EARLY_Pos 0UL
#define BLE_BLELL_CONN_CONFIG_EXT_CONN_REQ_2SLOT_EARLY_Msk 0x1UL
#define BLE_BLELL_CONN_CONFIG_EXT_CONN_REQ_3SLOT_EARLY_Pos 1UL
#define BLE_BLELL_CONN_CONFIG_EXT_CONN_REQ_3SLOT_EARLY_Msk 0x2UL
#define BLE_BLELL_CONN_CONFIG_EXT_FW_PKT_RCV_CONN_INDEX_Pos 2UL
#define BLE_BLELL_CONN_CONFIG_EXT_FW_PKT_RCV_CONN_INDEX_Msk 0x7CUL
#define BLE_BLELL_CONN_CONFIG_EXT_MMMS_RX_PKT_LIMIT_Pos 8UL
#define BLE_BLELL_CONN_CONFIG_EXT_MMMS_RX_PKT_LIMIT_Msk 0x3F00UL
#define BLE_BLELL_CONN_CONFIG_EXT_DEBUG_CE_EXPIRE_Pos 14UL
#define BLE_BLELL_CONN_CONFIG_EXT_DEBUG_CE_EXPIRE_Msk 0x4000UL
#define BLE_BLELL_CONN_CONFIG_EXT_MT_PDU_CE_EXPIRE_Pos 15UL
#define BLE_BLELL_CONN_CONFIG_EXT_MT_PDU_CE_EXPIRE_Msk 0x8000UL
/* BLE_BLELL.DPLL_CONFIG */
#define BLE_BLELL_DPLL_CONFIG_DPLL_CORREL_CONFIG_Pos 0UL
#define BLE_BLELL_DPLL_CONFIG_DPLL_CORREL_CONFIG_Msk 0xFFFFUL
/* BLE_BLELL.INIT_NI_VAL */
#define BLE_BLELL_INIT_NI_VAL_INIT_NI_VAL_Pos   0UL
#define BLE_BLELL_INIT_NI_VAL_INIT_NI_VAL_Msk   0xFFFFUL
/* BLE_BLELL.INIT_WINDOW_OFFSET */
#define BLE_BLELL_INIT_WINDOW_OFFSET_INIT_WINDOW_NI_Pos 0UL
#define BLE_BLELL_INIT_WINDOW_OFFSET_INIT_WINDOW_NI_Msk 0xFFFFUL
/* BLE_BLELL.INIT_WINDOW_NI_ANCHOR_PT */
#define BLE_BLELL_INIT_WINDOW_NI_ANCHOR_PT_INIT_INT_OFF_CAPT_Pos 0UL
#define BLE_BLELL_INIT_WINDOW_NI_ANCHOR_PT_INIT_INT_OFF_CAPT_Msk 0xFFFFUL
/* BLE_BLELL.CONN_UPDATE_NEW_INTERVAL */
#define BLE_BLELL_CONN_UPDATE_NEW_INTERVAL_CONN_UPDT_INTERVAL_Pos 0UL
#define BLE_BLELL_CONN_UPDATE_NEW_INTERVAL_CONN_UPDT_INTERVAL_Msk 0xFFFFUL
/* BLE_BLELL.CONN_UPDATE_NEW_LATENCY */
#define BLE_BLELL_CONN_UPDATE_NEW_LATENCY_CONN_UPDT_SLV_LATENCY_Pos 0UL
#define BLE_BLELL_CONN_UPDATE_NEW_LATENCY_CONN_UPDT_SLV_LATENCY_Msk 0xFFFFUL
/* BLE_BLELL.CONN_UPDATE_NEW_SUP_TO */
#define BLE_BLELL_CONN_UPDATE_NEW_SUP_TO_CONN_UPDT_SUP_TO_Pos 0UL
#define BLE_BLELL_CONN_UPDATE_NEW_SUP_TO_CONN_UPDT_SUP_TO_Msk 0xFFFFUL
/* BLE_BLELL.CONN_UPDATE_NEW_SL_INTERVAL */
#define BLE_BLELL_CONN_UPDATE_NEW_SL_INTERVAL_SL_CONN_INTERVAL_VAL_Pos 0UL
#define BLE_BLELL_CONN_UPDATE_NEW_SL_INTERVAL_SL_CONN_INTERVAL_VAL_Msk 0xFFFFUL
/* BLE_BLELL.CONN_REQ_WORD0 */
#define BLE_BLELL_CONN_REQ_WORD0_ACCESS_ADDR_LOWER_Pos 0UL
#define BLE_BLELL_CONN_REQ_WORD0_ACCESS_ADDR_LOWER_Msk 0xFFFFUL
/* BLE_BLELL.CONN_REQ_WORD1 */
#define BLE_BLELL_CONN_REQ_WORD1_ACCESS_ADDR_UPPER_Pos 0UL
#define BLE_BLELL_CONN_REQ_WORD1_ACCESS_ADDR_UPPER_Msk 0xFFFFUL
/* BLE_BLELL.CONN_REQ_WORD2 */
#define BLE_BLELL_CONN_REQ_WORD2_TX_WINDOW_SIZE_VAL_Pos 0UL
#define BLE_BLELL_CONN_REQ_WORD2_TX_WINDOW_SIZE_VAL_Msk 0xFFUL
#define BLE_BLELL_CONN_REQ_WORD2_CRC_INIT_LOWER_Pos 8UL
#define BLE_BLELL_CONN_REQ_WORD2_CRC_INIT_LOWER_Msk 0xFF00UL
/* BLE_BLELL.CONN_REQ_WORD3 */
#define BLE_BLELL_CONN_REQ_WORD3_CRC_INIT_UPPER_Pos 0UL
#define BLE_BLELL_CONN_REQ_WORD3_CRC_INIT_UPPER_Msk 0xFFFFUL
/* BLE_BLELL.CONN_REQ_WORD4 */
#define BLE_BLELL_CONN_REQ_WORD4_TX_WINDOW_OFFSET_Pos 0UL
#define BLE_BLELL_CONN_REQ_WORD4_TX_WINDOW_OFFSET_Msk 0xFFFFUL
/* BLE_BLELL.CONN_REQ_WORD5 */
#define BLE_BLELL_CONN_REQ_WORD5_CONNECTION_INTERVAL_VAL_Pos 0UL
#define BLE_BLELL_CONN_REQ_WORD5_CONNECTION_INTERVAL_VAL_Msk 0xFFFFUL
/* BLE_BLELL.CONN_REQ_WORD6 */
#define BLE_BLELL_CONN_REQ_WORD6_SLAVE_LATENCY_VAL_Pos 0UL
#define BLE_BLELL_CONN_REQ_WORD6_SLAVE_LATENCY_VAL_Msk 0xFFFFUL
/* BLE_BLELL.CONN_REQ_WORD7 */
#define BLE_BLELL_CONN_REQ_WORD7_SUPERVISION_TIMEOUT_VAL_Pos 0UL
#define BLE_BLELL_CONN_REQ_WORD7_SUPERVISION_TIMEOUT_VAL_Msk 0xFFFFUL
/* BLE_BLELL.CONN_REQ_WORD8 */
#define BLE_BLELL_CONN_REQ_WORD8_DATA_CHANNELS_LOWER_Pos 0UL
#define BLE_BLELL_CONN_REQ_WORD8_DATA_CHANNELS_LOWER_Msk 0xFFFFUL
/* BLE_BLELL.CONN_REQ_WORD9 */
#define BLE_BLELL_CONN_REQ_WORD9_DATA_CHANNELS_MID_Pos 0UL
#define BLE_BLELL_CONN_REQ_WORD9_DATA_CHANNELS_MID_Msk 0xFFFFUL
/* BLE_BLELL.CONN_REQ_WORD10 */
#define BLE_BLELL_CONN_REQ_WORD10_DATA_CHANNELS_UPPER_Pos 0UL
#define BLE_BLELL_CONN_REQ_WORD10_DATA_CHANNELS_UPPER_Msk 0x1FUL
/* BLE_BLELL.CONN_REQ_WORD11 */
#define BLE_BLELL_CONN_REQ_WORD11_HOP_INCREMENT_2_Pos 0UL
#define BLE_BLELL_CONN_REQ_WORD11_HOP_INCREMENT_2_Msk 0x1FUL
#define BLE_BLELL_CONN_REQ_WORD11_SCA_2_Pos     5UL
#define BLE_BLELL_CONN_REQ_WORD11_SCA_2_Msk     0xE0UL
/* BLE_BLELL.PDU_RESP_TIMER */
#define BLE_BLELL_PDU_RESP_TIMER_PDU_RESP_TIME_VAL_Pos 0UL
#define BLE_BLELL_PDU_RESP_TIMER_PDU_RESP_TIME_VAL_Msk 0xFFFFUL
/* BLE_BLELL.NEXT_RESP_TIMER_EXP */
#define BLE_BLELL_NEXT_RESP_TIMER_EXP_NEXT_RESPONSE_INSTANT_Pos 0UL
#define BLE_BLELL_NEXT_RESP_TIMER_EXP_NEXT_RESPONSE_INSTANT_Msk 0xFFFFUL
/* BLE_BLELL.NEXT_SUP_TO */
#define BLE_BLELL_NEXT_SUP_TO_NEXT_TIMEOUT_INSTANT_Pos 0UL
#define BLE_BLELL_NEXT_SUP_TO_NEXT_TIMEOUT_INSTANT_Msk 0xFFFFUL
/* BLE_BLELL.LLH_FEATURE_CONFIG */
#define BLE_BLELL_LLH_FEATURE_CONFIG_QUICK_TRANSMIT_Pos 0UL
#define BLE_BLELL_LLH_FEATURE_CONFIG_QUICK_TRANSMIT_Msk 0x1UL
#define BLE_BLELL_LLH_FEATURE_CONFIG_SL_DSM_EN_Pos 1UL
#define BLE_BLELL_LLH_FEATURE_CONFIG_SL_DSM_EN_Msk 0x2UL
#define BLE_BLELL_LLH_FEATURE_CONFIG_US_COUNTER_OFFSET_ADJ_Pos 2UL
#define BLE_BLELL_LLH_FEATURE_CONFIG_US_COUNTER_OFFSET_ADJ_Msk 0x4UL
/* BLE_BLELL.WIN_MIN_STEP_SIZE */
#define BLE_BLELL_WIN_MIN_STEP_SIZE_STEPDN_Pos  0UL
#define BLE_BLELL_WIN_MIN_STEP_SIZE_STEPDN_Msk  0xFUL
#define BLE_BLELL_WIN_MIN_STEP_SIZE_STEPUP_Pos  4UL
#define BLE_BLELL_WIN_MIN_STEP_SIZE_STEPUP_Msk  0xF0UL
#define BLE_BLELL_WIN_MIN_STEP_SIZE_WINDOW_MIN_FW_Pos 8UL
#define BLE_BLELL_WIN_MIN_STEP_SIZE_WINDOW_MIN_FW_Msk 0xFF00UL
/* BLE_BLELL.SLV_WIN_ADJ */
#define BLE_BLELL_SLV_WIN_ADJ_SLV_WIN_ADJ_Pos   0UL
#define BLE_BLELL_SLV_WIN_ADJ_SLV_WIN_ADJ_Msk   0x7FFUL
/* BLE_BLELL.SL_CONN_INTERVAL */
#define BLE_BLELL_SL_CONN_INTERVAL_SL_CONN_INTERVAL_VAL_Pos 0UL
#define BLE_BLELL_SL_CONN_INTERVAL_SL_CONN_INTERVAL_VAL_Msk 0xFFFFUL
/* BLE_BLELL.LE_PING_TIMER_ADDR */
#define BLE_BLELL_LE_PING_TIMER_ADDR_CONN_PING_TIMER_ADDR_Pos 0UL
#define BLE_BLELL_LE_PING_TIMER_ADDR_CONN_PING_TIMER_ADDR_Msk 0xFFFFUL
/* BLE_BLELL.LE_PING_TIMER_OFFSET */
#define BLE_BLELL_LE_PING_TIMER_OFFSET_CONN_PING_TIMER_OFFSET_Pos 0UL
#define BLE_BLELL_LE_PING_TIMER_OFFSET_CONN_PING_TIMER_OFFSET_Msk 0xFFFFUL
/* BLE_BLELL.LE_PING_TIMER_NEXT_EXP */
#define BLE_BLELL_LE_PING_TIMER_NEXT_EXP_CONN_PING_TIMER_NEXT_EXP_Pos 0UL
#define BLE_BLELL_LE_PING_TIMER_NEXT_EXP_CONN_PING_TIMER_NEXT_EXP_Msk 0xFFFFUL
/* BLE_BLELL.LE_PING_TIMER_WRAP_COUNT */
#define BLE_BLELL_LE_PING_TIMER_WRAP_COUNT_CONN_SEC_CURRENT_WRAP_Pos 0UL
#define BLE_BLELL_LE_PING_TIMER_WRAP_COUNT_CONN_SEC_CURRENT_WRAP_Msk 0xFFFFUL
/* BLE_BLELL.TX_EN_EXT_DELAY */
#define BLE_BLELL_TX_EN_EXT_DELAY_TXEN_EXT_DELAY_Pos 0UL
#define BLE_BLELL_TX_EN_EXT_DELAY_TXEN_EXT_DELAY_Msk 0xFUL
#define BLE_BLELL_TX_EN_EXT_DELAY_RXEN_EXT_DELAY_Pos 4UL
#define BLE_BLELL_TX_EN_EXT_DELAY_RXEN_EXT_DELAY_Msk 0xF0UL
#define BLE_BLELL_TX_EN_EXT_DELAY_DEMOD_2M_COMP_DLY_Pos 8UL
#define BLE_BLELL_TX_EN_EXT_DELAY_DEMOD_2M_COMP_DLY_Msk 0xF00UL
#define BLE_BLELL_TX_EN_EXT_DELAY_MOD_2M_COMP_DLY_Pos 12UL
#define BLE_BLELL_TX_EN_EXT_DELAY_MOD_2M_COMP_DLY_Msk 0xF000UL
/* BLE_BLELL.TX_RX_SYNTH_DELAY */
#define BLE_BLELL_TX_RX_SYNTH_DELAY_RX_EN_DELAY_Pos 0UL
#define BLE_BLELL_TX_RX_SYNTH_DELAY_RX_EN_DELAY_Msk 0xFFUL
#define BLE_BLELL_TX_RX_SYNTH_DELAY_TX_EN_DELAY_Pos 8UL
#define BLE_BLELL_TX_RX_SYNTH_DELAY_TX_EN_DELAY_Msk 0xFF00UL
/* BLE_BLELL.EXT_PA_LNA_DLY_CNFG */
#define BLE_BLELL_EXT_PA_LNA_DLY_CNFG_LNA_CTL_DELAY_Pos 0UL
#define BLE_BLELL_EXT_PA_LNA_DLY_CNFG_LNA_CTL_DELAY_Msk 0xFFUL
#define BLE_BLELL_EXT_PA_LNA_DLY_CNFG_PA_CTL_DELAY_Pos 8UL
#define BLE_BLELL_EXT_PA_LNA_DLY_CNFG_PA_CTL_DELAY_Msk 0xFF00UL
/* BLE_BLELL.LL_CONFIG */
#define BLE_BLELL_LL_CONFIG_RSSI_SEL_Pos        0UL
#define BLE_BLELL_LL_CONFIG_RSSI_SEL_Msk        0x1UL
#define BLE_BLELL_LL_CONFIG_TX_RX_CTRL_SEL_Pos  1UL
#define BLE_BLELL_LL_CONFIG_TX_RX_CTRL_SEL_Msk  0x2UL
#define BLE_BLELL_LL_CONFIG_TIFS_ENABLE_Pos     2UL
#define BLE_BLELL_LL_CONFIG_TIFS_ENABLE_Msk     0x4UL
#define BLE_BLELL_LL_CONFIG_TIMER_LF_SLOT_ENABLE_Pos 3UL
#define BLE_BLELL_LL_CONFIG_TIMER_LF_SLOT_ENABLE_Msk 0x8UL
#define BLE_BLELL_LL_CONFIG_RSSI_INTR_SEL_Pos   5UL
#define BLE_BLELL_LL_CONFIG_RSSI_INTR_SEL_Msk   0x20UL
#define BLE_BLELL_LL_CONFIG_RSSI_EARLY_CNFG_Pos 6UL
#define BLE_BLELL_LL_CONFIG_RSSI_EARLY_CNFG_Msk 0x40UL
#define BLE_BLELL_LL_CONFIG_TX_RX_PIN_DLY_Pos   7UL
#define BLE_BLELL_LL_CONFIG_TX_RX_PIN_DLY_Msk   0x80UL
#define BLE_BLELL_LL_CONFIG_TX_PA_PWR_LVL_TYPE_Pos 8UL
#define BLE_BLELL_LL_CONFIG_TX_PA_PWR_LVL_TYPE_Msk 0x100UL
#define BLE_BLELL_LL_CONFIG_RSSI_ENERGY_RD_Pos  9UL
#define BLE_BLELL_LL_CONFIG_RSSI_ENERGY_RD_Msk  0x200UL
#define BLE_BLELL_LL_CONFIG_RSSI_EACH_PKT_Pos   10UL
#define BLE_BLELL_LL_CONFIG_RSSI_EACH_PKT_Msk   0x400UL
#define BLE_BLELL_LL_CONFIG_FORCE_TRIG_RCB_UPDATE_Pos 11UL
#define BLE_BLELL_LL_CONFIG_FORCE_TRIG_RCB_UPDATE_Msk 0x800UL
#define BLE_BLELL_LL_CONFIG_CHECK_DUP_CONN_Pos  12UL
#define BLE_BLELL_LL_CONFIG_CHECK_DUP_CONN_Msk  0x1000UL
#define BLE_BLELL_LL_CONFIG_MULTI_ENGINE_LPM_Pos 13UL
#define BLE_BLELL_LL_CONFIG_MULTI_ENGINE_LPM_Msk 0x2000UL
#define BLE_BLELL_LL_CONFIG_ADV_DIR_DEVICE_PRIV_EN_Pos 14UL
#define BLE_BLELL_LL_CONFIG_ADV_DIR_DEVICE_PRIV_EN_Msk 0x4000UL
/* BLE_BLELL.LL_CONTROL */
#define BLE_BLELL_LL_CONTROL_PRIV_1_2_Pos       0UL
#define BLE_BLELL_LL_CONTROL_PRIV_1_2_Msk       0x1UL
#define BLE_BLELL_LL_CONTROL_DLE_Pos            1UL
#define BLE_BLELL_LL_CONTROL_DLE_Msk            0x2UL
#define BLE_BLELL_LL_CONTROL_WL_READ_AS_MEM_Pos 2UL
#define BLE_BLELL_LL_CONTROL_WL_READ_AS_MEM_Msk 0x4UL
#define BLE_BLELL_LL_CONTROL_ADVCH_FIFO_PRIV_1_2_FLUSH_CTRL_Pos 3UL
#define BLE_BLELL_LL_CONTROL_ADVCH_FIFO_PRIV_1_2_FLUSH_CTRL_Msk 0x8UL
#define BLE_BLELL_LL_CONTROL_HW_RSLV_LIST_FULL_Pos 4UL
#define BLE_BLELL_LL_CONTROL_HW_RSLV_LIST_FULL_Msk 0x10UL
#define BLE_BLELL_LL_CONTROL_RPT_INIT_ADDR_MATCH_PRIV_MISMATCH_ADV_Pos 5UL
#define BLE_BLELL_LL_CONTROL_RPT_INIT_ADDR_MATCH_PRIV_MISMATCH_ADV_Msk 0x20UL
#define BLE_BLELL_LL_CONTROL_RPT_SCAN_ADDR_MATCH_PRIV_MISMATCH_ADV_Pos 6UL
#define BLE_BLELL_LL_CONTROL_RPT_SCAN_ADDR_MATCH_PRIV_MISMATCH_ADV_Msk 0x40UL
#define BLE_BLELL_LL_CONTROL_RPT_PEER_ADDR_MATCH_PRIV_MISMATCH_SCN_Pos 7UL
#define BLE_BLELL_LL_CONTROL_RPT_PEER_ADDR_MATCH_PRIV_MISMATCH_SCN_Msk 0x80UL
#define BLE_BLELL_LL_CONTROL_RPT_PEER_ADDR_MATCH_PRIV_MISMATCH_INI_Pos 8UL
#define BLE_BLELL_LL_CONTROL_RPT_PEER_ADDR_MATCH_PRIV_MISMATCH_INI_Msk 0x100UL
#define BLE_BLELL_LL_CONTROL_RPT_SELF_ADDR_MATCH_PRIV_MISMATCH_INI_Pos 9UL
#define BLE_BLELL_LL_CONTROL_RPT_SELF_ADDR_MATCH_PRIV_MISMATCH_INI_Msk 0x200UL
#define BLE_BLELL_LL_CONTROL_PRIV_1_2_ADV_Pos   10UL
#define BLE_BLELL_LL_CONTROL_PRIV_1_2_ADV_Msk   0x400UL
#define BLE_BLELL_LL_CONTROL_PRIV_1_2_SCAN_Pos  11UL
#define BLE_BLELL_LL_CONTROL_PRIV_1_2_SCAN_Msk  0x800UL
#define BLE_BLELL_LL_CONTROL_PRIV_1_2_INIT_Pos  12UL
#define BLE_BLELL_LL_CONTROL_PRIV_1_2_INIT_Msk  0x1000UL
#define BLE_BLELL_LL_CONTROL_EN_CONN_RX_EN_MOD_Pos 13UL
#define BLE_BLELL_LL_CONTROL_EN_CONN_RX_EN_MOD_Msk 0x2000UL
#define BLE_BLELL_LL_CONTROL_SLV_CONN_PEER_RPA_NOT_RSLVD_Pos 14UL
#define BLE_BLELL_LL_CONTROL_SLV_CONN_PEER_RPA_NOT_RSLVD_Msk 0x4000UL
#define BLE_BLELL_LL_CONTROL_ADVCH_FIFO_FLUSH_Pos 15UL
#define BLE_BLELL_LL_CONTROL_ADVCH_FIFO_FLUSH_Msk 0x8000UL
/* BLE_BLELL.DEV_PA_ADDR_L */
#define BLE_BLELL_DEV_PA_ADDR_L_DEV_PA_ADDR_L_Pos 0UL
#define BLE_BLELL_DEV_PA_ADDR_L_DEV_PA_ADDR_L_Msk 0xFFFFUL
/* BLE_BLELL.DEV_PA_ADDR_M */
